src/scheme/continuation.org
#+TITLE: 续延
#+HTML_HEAD: <link rel="stylesheet" type="text/css" href="css/main.css" />
#+OPTIONS: num:nil timestamp:nil 

*续延* 是在 *运行中被暂停了的程序* ：即含有 *计算状态* 的 *单个函数型对象* 。当这个对象被求值时，就会在它上次停下来的地方重新启动之前保存下来的计算

* 定义
  *续延* 是一个代表着 _计算的将来_ 的函数。不管是哪一个表达式被求值，总会有谁在翘首以待它将要返回的值：
  #+BEGIN_SRC scheme
  (/ (- x 1) 2)
  #+END_SRC
  例如，当求值  _(- x 1)_ 时，外面的 _/_ 表达式就在等着这个值，依此类推下去，最后总是回到toplevel上 _print_ 正等在那里

  无论何时，都可以把续延视为 *带一个参数的函数* 。上面的表达式被输入到 toplevel，那么当子表达式 _(- x 1)_ 被求值时，续延将是：
  #+BEGIN_SRC scheme
  (lambda (val) (/ val 2))
  #+END_SRC

  也就是说，接下来的计算可以通过在返回值上调用这个函数来重现。如果该表达式在下面的上下文中出现：
  #+BEGIN_SRC scheme
  (define (f1 w)
    (let ((y (f2 w)))
      (if (integer? y) (list 'a y) 'b)))

  (define (f2 x)
    (/ (- x 1) 2))
  #+END_SRC

  并且 _f1_ 在toplevel 下被调用，那么当 _(- x 1)_ 被求值时，续延将等价于：
  #+BEGIN_SRC scheme
    (lambda (val)
      (let ((y (/ val 2)))
	(if (integer? y) (list 'a y) 'b)))
  #+END_SRC

  续延可以理解成是一种广义的闭包：
  + 闭包：一个 _函数_ 加上一些指向 _闭包创建时可见的词法变量的指针_
  + 续延：一个 _函数_ 加上一个指向其 _创建时所在的整个栈的指针_ 

  #+BEGIN_EXAMPLE
    当续延被求值时，它返回的是使用自己的栈拷贝算出的结果，而没有用当前栈

    如果某个续延是在 T1 时刻创建的，而在 T2 时刻被求值，那么它求值时使用的将是 T1 时刻的栈
  #+END_EXAMPLE

* call/cc
  在 Scheme 中，续延和函数同样是第一类对象。可以要求 Scheme 返回当前的续延，然后它将为你 *生成一个只有单个参数的函数* ，以表示 *未来的计算* 。可以任意长时间地保存这个对象，然后在你调用它时，它将重启当它被创建时所发生的计算

  Scheme 程序通过内置操作符 _call-with-current-continuation_ (缩写为 _call/cc_ ) 来 *访问当前续延* 。当一个程序在一个单个参数的函数上调用 call/cc 时：

  #+BEGIN_SRC scheme
  (call-with-current-continuation
    (lambda (cc)
      ...)) 
  #+END_SRC

  #+BEGIN_SRC scheme
  (define frozen '())

  (append '(the call/cc returned)
    (list (call-with-current-continuation
	(lambda (cc)
	  (set! frozen cc)
	  'a))))
  #+END_SRC

  虽然这个 call/cc 返回了 a ，实际上会把 *当前续延* 通过参数 _cc_ 传入，然后保存在了全局变量 _frozen_ 中，当前续延等价于：

  #+BEGIN_SRC scheme
  (lambda (val)
    (append '(the call/cc returned)
	    (list val)))

  (set! frozen (lambda (val)
		 (append '(the call/cc returned)
			 (list val))))
  #+END_SRC

  以后每次调用 _frozen_ 都可以认为是执行上面这段续延保存的过程：
  #+BEGIN_SRC scheme
  (frozen 'again) ; =>  (the call/cc returned again) 

  (append '(the call/cc returned)
	  (list 'again)) ; =>  (the call/cc returned again) 
  #+END_SRC 

  续延不会因为被求值而用完。它们可以被 *重复* 调用，就像任何其他的函数型对象一样：
  #+BEGIN_SRC scheme
  (frozen 'thrice) ; =>  (the call/cc returned thrice) 

  (append '(the call/cc returned)
	  (list 'thrice)) ; =>  (the call/cc returned thrice) 
  #+END_SRC

  当在某些其他的计算里调用一个续延时，可以更清楚地看到所谓返回到原先的栈上是什么意思：

  #+BEGIN_SRC scheme
  (+ 1 (frozen 'safely)) ; => (the call/cc returned safely)
  #+END_SRC

  注意：紧接着的 _+_ 当 _frozen_ 调用时被忽略掉了。后者返回到了它首次被创建时的栈上：先经过 list ，然后是 append ，直到 toplevel。如果 frozen 像正常函数调用那样返回了一个值，那么上面的表达式将在试图给一个列表加 1 时产生一个错误

  各续延并不会每人都分到自己的一份栈的拷贝。它们可能跟其他续延或者当前正在进行的计算 *共享一些变量* 。两个续延共享了同一个栈：

  #+BEGIN_SRC scheme
  (define froz1 '())
  (define froz2 '())

  (let ((x 0))
    (call-with-current-continuation
      (lambda (cc)
	(set! froz1 cc)
	(set! froz2 cc)))
    (set! x (+ 1 x))
    x) ; => 1
  #+END_SRC

  因此调用任何一个都将返回后继的整数：
  #+BEGIN_SRC scheme
  (froz1 '()) ;=> 2

  (froz2 '()) ;=> 3
  #+END_SRC

  由于 call/cc 表达式的值将被丢弃，所以无论给 _froz1_ 和 _froz2_ 什么参数都无关紧要

