src/scheme/continuation.org
** 递归CPS 
   递归函数仍然可以被写成CPS风格：
   #+BEGIN_SRC scheme
  ;;; normal factorial
  (define (fact n)
    (if (= n 1) 
	1
	(* n (fact (- n 1)))))

  ;;; CPS factorial
  (define (kfact n k)
    (if (= n 1) 
	(k 1)
	(kfact (- n 1)
	       (lambda (x) (k (* n x))))))

  (kfact 5 return) ; =>  120

  ;; (kfact 1 return) ; => (return 1)  => 1 

  ;; (kfact 2 return) 
  ;; (kfact 1 (lambda (x) (return (* 2 x)))) ;=> (return (* 2 (kfact 1 return))) => 2 

  ;; (kfact 3 return)
  ;; (kfact 2 (lambda (x) (return (* 3 x)))) ; => (return (* 3 (kfact 2 return))) => 6  
   #+END_SRC

   用CPS来计算 _(+ 3 (fact 4))_  
   #+BEGIN_SRC scheme
  ;;; normal
  (+ 3 (fact 4)) ;=> 27

  ;;; CPS
  (kfact 4 (lambda (x) (k+ x 3 return))) ; => 27 
   #+END_SRC

   用CPS来计算多个数的乘积， 注意：这里使用了一个局部变量break来保存返回函数，是的出现数字0的情况下，可以马上返回
   #+BEGIN_SRC scheme
  ;;; normal
  (define (product ls)
    (let loop ((ls ls) (acc 1))
      (cond
       ((null? ls) acc)
       ((zero? (car ls)) 0)
       (else (loop (cdr ls) (* (car ls) acc))))))

  ;;; CPS
  (define (kproduct ls k)
    (let ((break k))
      (let loop ((ls ls) (k k))
	(cond
	 ((null? ls) (k 1))
	 ((zero? (car ls)) (break 0))
	 (else (loop (cdr ls) (lambda (x) (k (* (car ls) x)))))))))
   #+END_SRC

   计算 _(+ 100 (product '(2 4 7)))_ ：
   #+BEGIN_SRC scheme
  ;;; normal
  (+ 100 (product '(2 4 7))) ; => 156 

  ;;; CPS
  (kproduct '(2 4 7)
	    (lambda (x)
	      (k+ x 100 return))) ;=> 156
   #+END_SRC

   尽管对于上面那些简单的例子而言：CPS编程风格显得有点迂回，但是对于复杂的问题，比如自然语言解析和逻辑式编程非常有用。因为这时候由于可以动态传入如何处理返回值，比起同样的判断返回值而言，显得灵活得多 

   下面是一个异常处理的例子：

   #+BEGIN_SRC scheme
  (define (non-number-value-error x)
    (display "Value error: ")
    (display  x)
    (display " is not number.")
    (newline)
    'error)

  (define (kproduct ls k k-value-error)
    (let ((break k))
      (let loop ((ls ls) (k k))
	(cond
	 ((null? ls) (k 1))
	 ((not (number? (car ls))) (k-value-error (car ls)))
	 ((zero? (car ls)) (break 0))
	 (else (loop (cdr ls) (lambda (x) (k (* (car ls) x)))))))))
   #+END_SRC

   测试结果：
   #+BEGIN_SRC scheme
  ;;; valid
  (kproduct '(2 4 7) 
	    (lambda (x) (k+ x 100 return)) 
	    non-number-value-error) ; => 156

  ;;; invalid
  (kproduct '(2 4 7 hoge) 
	    (lambda (x) (k+ x 100 return)) 
	    non-number-value-error)

  ;; Value error: hoge is not number.
  ;; => error
   #+END_SRC

