html/scheme/continuation.html

<div id="outline-container-org96fc151" class="outline-3">
<h3 id="org96fc151">递归CPS</h3>
<div class="outline-text-3" id="text-org96fc151">
<p>
递归函数仍然可以被写成CPS风格：
</p>
<div class="org-src-container">
<pre class="src src-scheme"><span style="color: #5f9ea0; font-style: italic;">;;; </span><span style="color: #5f9ea0; font-style: italic;">normal factorial</span>
<span style="color: #696969;">(</span><span style="color: #00bfff; font-weight: bold;">define</span> <span style="color: #696969;">(</span><span style="color: #daa520; font-weight: bold;">fact</span> n<span style="color: #696969;">)</span>
  <span style="color: #696969;">(</span><span style="color: #00bfff; font-weight: bold;">if</span> <span style="color: #696969;">(</span>= n 1<span style="color: #696969;">)</span> 
      1
      <span style="color: #696969;">(</span>* n <span style="color: #696969;">(</span>fact <span style="color: #696969;">(</span>- n 1<span style="color: #696969;">)))))</span>

<span style="color: #5f9ea0; font-style: italic;">;;; </span><span style="color: #5f9ea0; font-style: italic;">CPS factorial</span>
<span style="color: #696969;">(</span><span style="color: #00bfff; font-weight: bold;">define</span> <span style="color: #696969;">(</span><span style="color: #daa520; font-weight: bold;">kfact</span> n k<span style="color: #696969;">)</span>
  <span style="color: #696969;">(</span><span style="color: #00bfff; font-weight: bold;">if</span> <span style="color: #696969;">(</span>= n 1<span style="color: #696969;">)</span> 
      <span style="color: #696969;">(</span>k 1<span style="color: #696969;">)</span>
      <span style="color: #696969;">(</span>kfact <span style="color: #696969;">(</span>- n 1<span style="color: #696969;">)</span>
             <span style="color: #696969;">(</span><span style="color: #00bfff; font-weight: bold;">lambda</span> <span style="color: #696969;">(</span>x<span style="color: #696969;">)</span> <span style="color: #696969;">(</span>k <span style="color: #696969;">(</span>* n x<span style="color: #696969;">))))))</span>

<span style="color: #696969;">(</span>kfact 5 return<span style="color: #696969;">)</span> <span style="color: #5f9ea0; font-style: italic;">; </span><span style="color: #5f9ea0; font-style: italic;">=&gt;  120</span>

<span style="color: #5f9ea0; font-style: italic;">;; </span><span style="color: #5f9ea0; font-style: italic;">(kfact 1 return) ; =&gt; (return 1)  =&gt; 1 </span>

<span style="color: #5f9ea0; font-style: italic;">;; </span><span style="color: #5f9ea0; font-style: italic;">(kfact 2 return) </span>
<span style="color: #5f9ea0; font-style: italic;">;; </span><span style="color: #5f9ea0; font-style: italic;">(kfact 1 (lambda (x) (return (* 2 x)))) ;=&gt; (return (* 2 (kfact 1 return))) =&gt; 2 </span>

<span style="color: #5f9ea0; font-style: italic;">;; </span><span style="color: #5f9ea0; font-style: italic;">(kfact 3 return)</span>
<span style="color: #5f9ea0; font-style: italic;">;; </span><span style="color: #5f9ea0; font-style: italic;">(kfact 2 (lambda (x) (return (* 3 x)))) ; =&gt; (return (* 3 (kfact 2 return))) =&gt; 6  </span>
</pre>
</div>

<p>
用CPS来计算 <span class="underline">(+ 3 (fact 4))</span>  
</p>
<div class="org-src-container">
<pre class="src src-scheme"><span style="color: #5f9ea0; font-style: italic;">;;; </span><span style="color: #5f9ea0; font-style: italic;">normal</span>
<span style="color: #696969;">(</span>+ 3 <span style="color: #696969;">(</span>fact 4<span style="color: #696969;">))</span> <span style="color: #5f9ea0; font-style: italic;">;</span><span style="color: #5f9ea0; font-style: italic;">=&gt; 27</span>

<span style="color: #5f9ea0; font-style: italic;">;;; </span><span style="color: #5f9ea0; font-style: italic;">CPS</span>
<span style="color: #696969;">(</span>kfact 4 <span style="color: #696969;">(</span><span style="color: #00bfff; font-weight: bold;">lambda</span> <span style="color: #696969;">(</span>x<span style="color: #696969;">)</span> <span style="color: #696969;">(</span>k+ x 3 return<span style="color: #696969;">)))</span> <span style="color: #5f9ea0; font-style: italic;">; </span><span style="color: #5f9ea0; font-style: italic;">=&gt; 27 </span>
</pre>
</div>

<p>
用CPS来计算多个数的乘积， 注意：这里使用了一个局部变量break来保存返回函数，是的出现数字0的情况下，可以马上返回
</p>
<div class="org-src-container">
<pre class="src src-scheme"><span style="color: #5f9ea0; font-style: italic;">;;; </span><span style="color: #5f9ea0; font-style: italic;">normal</span>
<span style="color: #696969;">(</span><span style="color: #00bfff; font-weight: bold;">define</span> <span style="color: #696969;">(</span><span style="color: #daa520; font-weight: bold;">product</span> ls<span style="color: #696969;">)</span>
  <span style="color: #696969;">(</span><span style="color: #00bfff; font-weight: bold;">let</span> <span style="color: #daa520; font-weight: bold;">loop</span> <span style="color: #696969;">((</span>ls ls<span style="color: #696969;">)</span> <span style="color: #696969;">(</span>acc 1<span style="color: #696969;">))</span>
    <span style="color: #696969;">(</span><span style="color: #00bfff; font-weight: bold;">cond</span>
     <span style="color: #696969;">((</span>null? ls<span style="color: #696969;">)</span> acc<span style="color: #696969;">)</span>
     <span style="color: #696969;">((</span>zero? <span style="color: #696969;">(</span>car ls<span style="color: #696969;">))</span> 0<span style="color: #696969;">)</span>
     <span style="color: #696969;">(</span><span style="color: #00bfff; font-weight: bold;">else</span> <span style="color: #696969;">(</span>loop <span style="color: #696969;">(</span>cdr ls<span style="color: #696969;">)</span> <span style="color: #696969;">(</span>* <span style="color: #696969;">(</span>car ls<span style="color: #696969;">)</span> acc<span style="color: #696969;">))))))</span>

<span style="color: #5f9ea0; font-style: italic;">;;; </span><span style="color: #5f9ea0; font-style: italic;">CPS</span>
<span style="color: #696969;">(</span><span style="color: #00bfff; font-weight: bold;">define</span> <span style="color: #696969;">(</span><span style="color: #daa520; font-weight: bold;">kproduct</span> ls k<span style="color: #696969;">)</span>
  <span style="color: #696969;">(</span><span style="color: #00bfff; font-weight: bold;">let</span> <span style="color: #696969;">((</span>break k<span style="color: #696969;">))</span>
    <span style="color: #696969;">(</span><span style="color: #00bfff; font-weight: bold;">let</span> <span style="color: #daa520; font-weight: bold;">loop</span> <span style="color: #696969;">((</span>ls ls<span style="color: #696969;">)</span> <span style="color: #696969;">(</span>k k<span style="color: #696969;">))</span>
      <span style="color: #696969;">(</span><span style="color: #00bfff; font-weight: bold;">cond</span>
       <span style="color: #696969;">((</span>null? ls<span style="color: #696969;">)</span> <span style="color: #696969;">(</span>k 1<span style="color: #696969;">))</span>
       <span style="color: #696969;">((</span>zero? <span style="color: #696969;">(</span>car ls<span style="color: #696969;">))</span> <span style="color: #696969;">(</span>break 0<span style="color: #696969;">))</span>
       <span style="color: #696969;">(</span><span style="color: #00bfff; font-weight: bold;">else</span> <span style="color: #696969;">(</span>loop <span style="color: #696969;">(</span>cdr ls<span style="color: #696969;">)</span> <span style="color: #696969;">(</span><span style="color: #00bfff; font-weight: bold;">lambda</span> <span style="color: #696969;">(</span>x<span style="color: #696969;">)</span> <span style="color: #696969;">(</span>k <span style="color: #696969;">(</span>* <span style="color: #696969;">(</span>car ls<span style="color: #696969;">)</span> x<span style="color: #696969;">)))))))))</span>
</pre>
</div>

<p>
计算 <span class="underline">(+ 100 (product '(2 4 7)))</span> ：
</p>
<div class="org-src-container">
<pre class="src src-scheme"><span style="color: #5f9ea0; font-style: italic;">;;; </span><span style="color: #5f9ea0; font-style: italic;">normal</span>
<span style="color: #696969;">(</span>+ 100 <span style="color: #696969;">(</span>product '<span style="color: #696969;">(</span>2 4 7<span style="color: #696969;">)))</span> <span style="color: #5f9ea0; font-style: italic;">; </span><span style="color: #5f9ea0; font-style: italic;">=&gt; 156 </span>

<span style="color: #5f9ea0; font-style: italic;">;;; </span><span style="color: #5f9ea0; font-style: italic;">CPS</span>
<span style="color: #696969;">(</span>kproduct '<span style="color: #696969;">(</span>2 4 7<span style="color: #696969;">)</span>
          <span style="color: #696969;">(</span><span style="color: #00bfff; font-weight: bold;">lambda</span> <span style="color: #696969;">(</span>x<span style="color: #696969;">)</span>
            <span style="color: #696969;">(</span>k+ x 100 return<span style="color: #696969;">)))</span> <span style="color: #5f9ea0; font-style: italic;">;</span><span style="color: #5f9ea0; font-style: italic;">=&gt; 156</span>
</pre>
</div>

<p>
尽管对于上面那些简单的例子而言：CPS编程风格显得有点迂回，但是对于复杂的问题，比如自然语言解析和逻辑式编程非常有用。因为这时候由于可以动态传入如何处理返回值，比起同样的判断返回值而言，显得灵活得多 
</p>

<p>
下面是一个异常处理的例子：
</p>

<div class="org-src-container">
<pre class="src src-scheme"><span style="color: #696969;">(</span><span style="color: #00bfff; font-weight: bold;">define</span> <span style="color: #696969;">(</span><span style="color: #daa520; font-weight: bold;">non-number-value-error</span> x<span style="color: #696969;">)</span>
  <span style="color: #696969;">(</span>display <span style="color: #deb887;">"Value error: "</span><span style="color: #696969;">)</span>
  <span style="color: #696969;">(</span>display  x<span style="color: #696969;">)</span>
  <span style="color: #696969;">(</span>display <span style="color: #deb887;">" is not number."</span><span style="color: #696969;">)</span>
  <span style="color: #696969;">(</span>newline<span style="color: #696969;">)</span>
  'error<span style="color: #696969;">)</span>

<span style="color: #696969;">(</span><span style="color: #00bfff; font-weight: bold;">define</span> <span style="color: #696969;">(</span><span style="color: #daa520; font-weight: bold;">kproduct</span> ls k k-value-error<span style="color: #696969;">)</span>
  <span style="color: #696969;">(</span><span style="color: #00bfff; font-weight: bold;">let</span> <span style="color: #696969;">((</span>break k<span style="color: #696969;">))</span>
    <span style="color: #696969;">(</span><span style="color: #00bfff; font-weight: bold;">let</span> <span style="color: #daa520; font-weight: bold;">loop</span> <span style="color: #696969;">((</span>ls ls<span style="color: #696969;">)</span> <span style="color: #696969;">(</span>k k<span style="color: #696969;">))</span>
      <span style="color: #696969;">(</span><span style="color: #00bfff; font-weight: bold;">cond</span>
       <span style="color: #696969;">((</span>null? ls<span style="color: #696969;">)</span> <span style="color: #696969;">(</span>k 1<span style="color: #696969;">))</span>
       <span style="color: #696969;">((</span>not <span style="color: #696969;">(</span>number? <span style="color: #696969;">(</span>car ls<span style="color: #696969;">)))</span> <span style="color: #696969;">(</span>k-value-error <span style="color: #696969;">(</span>car ls<span style="color: #696969;">)))</span>
       <span style="color: #696969;">((</span>zero? <span style="color: #696969;">(</span>car ls<span style="color: #696969;">))</span> <span style="color: #696969;">(</span>break 0<span style="color: #696969;">))</span>
       <span style="color: #696969;">(</span><span style="color: #00bfff; font-weight: bold;">else</span> <span style="color: #696969;">(</span>loop <span style="color: #696969;">(</span>cdr ls<span style="color: #696969;">)</span> <span style="color: #696969;">(</span><span style="color: #00bfff; font-weight: bold;">lambda</span> <span style="color: #696969;">(</span>x<span style="color: #696969;">)</span> <span style="color: #696969;">(</span>k <span style="color: #696969;">(</span>* <span style="color: #696969;">(</span>car ls<span style="color: #696969;">)</span> x<span style="color: #696969;">)))))))))</span>
</pre>
</div>

<p>
测试结果：
</p>
<div class="org-src-container">
<pre class="src src-scheme"><span style="color: #5f9ea0; font-style: italic;">;;; </span><span style="color: #5f9ea0; font-style: italic;">valid</span>
<span style="color: #696969;">(</span>kproduct '<span style="color: #696969;">(</span>2 4 7<span style="color: #696969;">)</span> 
          <span style="color: #696969;">(</span><span style="color: #00bfff; font-weight: bold;">lambda</span> <span style="color: #696969;">(</span>x<span style="color: #696969;">)</span> <span style="color: #696969;">(</span>k+ x 100 return<span style="color: #696969;">))</span> 
          non-number-value-error<span style="color: #696969;">)</span> <span style="color: #5f9ea0; font-style: italic;">; </span><span style="color: #5f9ea0; font-style: italic;">=&gt; 156</span>

<span style="color: #5f9ea0; font-style: italic;">;;; </span><span style="color: #5f9ea0; font-style: italic;">invalid</span>
<span style="color: #696969;">(</span>kproduct '<span style="color: #696969;">(</span>2 4 7 hoge<span style="color: #696969;">)</span> 
          <span style="color: #696969;">(</span><span style="color: #00bfff; font-weight: bold;">lambda</span> <span style="color: #696969;">(</span>x<span style="color: #696969;">)</span> <span style="color: #696969;">(</span>k+ x 100 return<span style="color: #696969;">))</span> 
          non-number-value-error<span style="color: #696969;">)</span>

<span style="color: #5f9ea0; font-style: italic;">;; </span><span style="color: #5f9ea0; font-style: italic;">Value error: hoge is not number.</span>
<span style="color: #5f9ea0; font-style: italic;">;; </span><span style="color: #5f9ea0; font-style: italic;">=&gt; error</span>
</pre>
</div>
</div>
</div>
