src/scheme/continuation.org
** 续延和CPS
   实际上CPS风格的最后一个参数，就可以被认为是当前的续延。所以一种通用的实现续延的方式就是 *通过遍历代码，把代码转换成CPS风格来得到当前续延*

* 应用
  对于求解特定类型的问题，能够保存程序的状态并在之后重启是非常有用的：
  + 在非确定性的搜索问题里，续延可以用来表示搜索树中的节点
  + 在多进程中，续延可以很方便地表示挂起的进程

** 实现amb 
   用 *一组通过续延来连接的闭包链* 来实现回溯，这组链条使用一个全局续延变量 *amb-fail* 作为入口，每次调用 _amb-fail_ ， 都会把 _amb-fail_ 恢复成前一个续延
*** amb-fail 全局变量
    _amb-fail_ 是最近一个失败的分支设置的函数。如果执行没有参数的 _(amb)_ 就会转到这个 _amb-fail_

    这里，把 _amb-fail_ 初始化成打印 “amb tree exhausted” ：

    #+BEGIN_SRC scheme
  (define amb-fail '*)

  (define initialize-amb-fail
    (lambda ()
      (set! amb-fail
	(lambda ()
	  (error "amb tree exhausted")))))

  (initialize-amb-fail)
    #+END_SRC
*** choose 函数
    定义 _choose_ 函数：
    1. 如果没有选择：那调用 _amb-fail_ 续延打印失败消息
    2. 如果还有选择：
       1. 保存 _amb-fail_ 到一个局部变量 _prev-amb-fail_
       2. 调用 _当前续延cc_ 
	  1) 创建一个新的匿名函数并赋值给 _amb-fail_ ，这个匿名函数： 
	     + 恢复 _amb-fail_ 为保存的 _prev-amb-fail_ 
	     + 在保存的 _续延 cc_ 中递归求值 _余下的选择_ 
	  2) 在 _当前续延cc_ 内求值 _第一个选择_ ，无论求值是否成功，都直接返回

    #+BEGIN_SRC scheme 
      (define (choose . ls) ; . 表示可变参数
	(if (null? ls) ; 如果没有选择：那调用 amb-fail 续延打印失败消息
	    (amb-fail) 
	  (let ((prev-amb-fail amb-fail)) ;  保存 amb-fail 到一个局部变量 prev-amb-fail
	    (call/cc ; 调用当前续延cc
	     (lambda (cc) 
		(set! amb-fail ; 创建一个新的匿名函数并赋值给 amb-fail
		      (lambda ()
			(set! amb-fail prev-amb-fail) ; 恢复 amb-fail 为保存的 prev-amb-fail
			(cc (apply choose (cdr ls))))) ; 在保存的续延 cc 中递归求值余下的选择
		(cc (car ls))))))) ; 在当前续延cc内求值第一个选择，无论求值是否成功，都直接返回
    #+END_SRC

    计算一个满足勾股定律的结果：
    #+BEGIN_SRC scheme
  ;;; 平方
  (define (sq x)
    (* x x))

  ;;; 勾股定律
  (define (pythag a b c)
    (if (= (+ (sq a) (sq b)) (sq c))
	(list a b c)
	(choose)))

  (pythag (choose 1 2 3) (choose 3 4 5) (choose  4 5 6)) ; => (3 4 5)
    #+END_SRC

