html/scheme/continuation.html

<div id="outline-container-org166ddcf" class="outline-3">
<h3 id="org166ddcf">续延和CPS</h3>
<div class="outline-text-3" id="text-org166ddcf">
<p>
实际上CPS风格的最后一个参数，就可以被认为是当前的续延。所以一种通用的实现续延的方式就是 <b>通过遍历代码，把代码转换成CPS风格来得到当前续延</b>
</p>
</div>
</div>
</div>

<div id="outline-container-org4ac85cd" class="outline-2">
<h2 id="org4ac85cd">应用</h2>
<div class="outline-text-2" id="text-org4ac85cd">
<p>
对于求解特定类型的问题，能够保存程序的状态并在之后重启是非常有用的：
</p>
<ul class="org-ul">
<li>在非确定性的搜索问题里，续延可以用来表示搜索树中的节点</li>
<li>在多进程中，续延可以很方便地表示挂起的进程</li>
</ul>
</div>

<div id="outline-container-org87b76d0" class="outline-3">
<h3 id="org87b76d0">实现amb</h3>
<div class="outline-text-3" id="text-org87b76d0">
<p>
用 <b>一组通过续延来连接的闭包链</b> 来实现回溯，这组链条使用一个全局续延变量 <b>amb-fail</b> 作为入口，每次调用 <span class="underline">amb-fail</span> ， 都会把 <span class="underline">amb-fail</span> 恢复成前一个续延
</p>
</div>
<div id="outline-container-orgff94fbc" class="outline-4">
<h4 id="orgff94fbc">amb-fail 全局变量</h4>
<div class="outline-text-4" id="text-orgff94fbc">
<p>
<span class="underline">amb-fail</span> 是最近一个失败的分支设置的函数。如果执行没有参数的 <span class="underline">(amb)</span> 就会转到这个 <span class="underline">amb-fail</span>
</p>

<p>
这里，把 <span class="underline">amb-fail</span> 初始化成打印 “amb tree exhausted” ：
</p>

<div class="org-src-container">
<pre class="src src-scheme"><span style="color: #696969;">(</span><span style="color: #00bfff; font-weight: bold;">define</span> <span style="color: #daa520; font-weight: bold;">amb-fail</span> '*<span style="color: #696969;">)</span>

<span style="color: #696969;">(</span><span style="color: #00bfff; font-weight: bold;">define</span> <span style="color: #daa520; font-weight: bold;">initialize-amb-fail</span>
  <span style="color: #696969;">(</span><span style="color: #00bfff; font-weight: bold;">lambda</span> <span style="color: #696969;">()</span>
    <span style="color: #696969;">(</span>set! amb-fail
      <span style="color: #696969;">(</span><span style="color: #00bfff; font-weight: bold;">lambda</span> <span style="color: #696969;">()</span>
        <span style="color: #696969;">(</span>error <span style="color: #deb887;">"amb tree exhausted"</span><span style="color: #696969;">)))))</span>

<span style="color: #696969;">(</span>initialize-amb-fail<span style="color: #696969;">)</span>
</pre>
</div>
</div>
</div>
<div id="outline-container-org2406c73" class="outline-4">
<h4 id="org2406c73">choose 函数</h4>
<div class="outline-text-4" id="text-org2406c73">
<p>
定义 <span class="underline">choose</span> 函数：
</p>
<ol class="org-ol">
<li>如果没有选择：那调用 <span class="underline">amb-fail</span> 续延打印失败消息</li>
<li>如果还有选择：
<ol class="org-ol">
<li>保存 <span class="underline">amb-fail</span> 到一个局部变量 <span class="underline">prev-amb-fail</span></li>
<li>调用 <span class="underline">当前续延cc</span> 
<ol class="org-ol">
<li>创建一个新的匿名函数并赋值给 <span class="underline">amb-fail</span> ，这个匿名函数： 
<ul class="org-ul">
<li>恢复 <span class="underline">amb-fail</span> 为保存的 <span class="underline">prev-amb-fail</span></li>
<li>在保存的 <span class="underline">续延 cc</span> 中递归求值 <span class="underline">余下的选择</span></li>
</ul></li>
<li>在 <span class="underline">当前续延cc</span> 内求值 <span class="underline">第一个选择</span> ，无论求值是否成功，都直接返回</li>
</ol></li>
</ol></li>
</ol>

<div class="org-src-container">
<pre class="src src-scheme"><span style="color: #696969;">(</span><span style="color: #00bfff; font-weight: bold;">define</span> <span style="color: #696969;">(</span><span style="color: #daa520; font-weight: bold;">choose</span> . ls<span style="color: #696969;">)</span> <span style="color: #5f9ea0; font-style: italic;">; </span><span style="color: #5f9ea0; font-style: italic;">. &#34920;&#31034;&#21487;&#21464;&#21442;&#25968;</span>
  <span style="color: #696969;">(</span><span style="color: #00bfff; font-weight: bold;">if</span> <span style="color: #696969;">(</span>null? ls<span style="color: #696969;">)</span> <span style="color: #5f9ea0; font-style: italic;">; </span><span style="color: #5f9ea0; font-style: italic;">&#22914;&#26524;&#27809;&#26377;&#36873;&#25321;&#65306;&#37027;&#35843;&#29992; amb-fail &#32493;&#24310;&#25171;&#21360;&#22833;&#36133;&#28040;&#24687;</span>
      <span style="color: #696969;">(</span>amb-fail<span style="color: #696969;">)</span> 
    <span style="color: #696969;">(</span><span style="color: #00bfff; font-weight: bold;">let</span> <span style="color: #696969;">((</span>prev-amb-fail amb-fail<span style="color: #696969;">))</span> <span style="color: #5f9ea0; font-style: italic;">;  </span><span style="color: #5f9ea0; font-style: italic;">&#20445;&#23384; amb-fail &#21040;&#19968;&#20010;&#23616;&#37096;&#21464;&#37327; prev-amb-fail</span>
      <span style="color: #696969;">(</span><span style="color: #00bfff; font-weight: bold;">call/cc</span> <span style="color: #5f9ea0; font-style: italic;">; </span><span style="color: #5f9ea0; font-style: italic;">&#35843;&#29992;&#24403;&#21069;&#32493;&#24310;cc</span>
       <span style="color: #696969;">(</span><span style="color: #00bfff; font-weight: bold;">lambda</span> <span style="color: #696969;">(</span>cc<span style="color: #696969;">)</span> 
          <span style="color: #696969;">(</span>set! amb-fail <span style="color: #5f9ea0; font-style: italic;">; </span><span style="color: #5f9ea0; font-style: italic;">&#21019;&#24314;&#19968;&#20010;&#26032;&#30340;&#21311;&#21517;&#20989;&#25968;&#24182;&#36171;&#20540;&#32473; amb-fail</span>
                <span style="color: #696969;">(</span><span style="color: #00bfff; font-weight: bold;">lambda</span> <span style="color: #696969;">()</span>
                  <span style="color: #696969;">(</span>set! amb-fail prev-amb-fail<span style="color: #696969;">)</span> <span style="color: #5f9ea0; font-style: italic;">; </span><span style="color: #5f9ea0; font-style: italic;">&#24674;&#22797; amb-fail &#20026;&#20445;&#23384;&#30340; prev-amb-fail</span>
                  <span style="color: #696969;">(</span>cc <span style="color: #696969;">(</span>apply choose <span style="color: #696969;">(</span>cdr ls<span style="color: #696969;">)))))</span> <span style="color: #5f9ea0; font-style: italic;">; </span><span style="color: #5f9ea0; font-style: italic;">&#22312;&#20445;&#23384;&#30340;&#32493;&#24310; cc &#20013;&#36882;&#24402;&#27714;&#20540;&#20313;&#19979;&#30340;&#36873;&#25321;</span>
          <span style="color: #696969;">(</span>cc <span style="color: #696969;">(</span>car ls<span style="color: #696969;">)))))))</span> <span style="color: #5f9ea0; font-style: italic;">; </span><span style="color: #5f9ea0; font-style: italic;">&#22312;&#24403;&#21069;&#32493;&#24310;cc&#20869;&#27714;&#20540;&#31532;&#19968;&#20010;&#36873;&#25321;&#65292;&#26080;&#35770;&#27714;&#20540;&#26159;&#21542;&#25104;&#21151;&#65292;&#37117;&#30452;&#25509;&#36820;&#22238;</span>
</pre>
</div>

<p>
计算一个满足勾股定律的结果：
</p>
<div class="org-src-container">
<pre class="src src-scheme"><span style="color: #5f9ea0; font-style: italic;">;;; </span><span style="color: #5f9ea0; font-style: italic;">&#24179;&#26041;</span>
<span style="color: #696969;">(</span><span style="color: #00bfff; font-weight: bold;">define</span> <span style="color: #696969;">(</span><span style="color: #daa520; font-weight: bold;">sq</span> x<span style="color: #696969;">)</span>
  <span style="color: #696969;">(</span>* x x<span style="color: #696969;">))</span>

<span style="color: #5f9ea0; font-style: italic;">;;; </span><span style="color: #5f9ea0; font-style: italic;">&#21246;&#32929;&#23450;&#24459;</span>
<span style="color: #696969;">(</span><span style="color: #00bfff; font-weight: bold;">define</span> <span style="color: #696969;">(</span><span style="color: #daa520; font-weight: bold;">pythag</span> a b c<span style="color: #696969;">)</span>
  <span style="color: #696969;">(</span><span style="color: #00bfff; font-weight: bold;">if</span> <span style="color: #696969;">(</span>= <span style="color: #696969;">(</span>+ <span style="color: #696969;">(</span>sq a<span style="color: #696969;">)</span> <span style="color: #696969;">(</span>sq b<span style="color: #696969;">))</span> <span style="color: #696969;">(</span>sq c<span style="color: #696969;">))</span>
      <span style="color: #696969;">(</span>list a b c<span style="color: #696969;">)</span>
      <span style="color: #696969;">(</span>choose<span style="color: #696969;">)))</span>

<span style="color: #696969;">(</span>pythag <span style="color: #696969;">(</span>choose 1 2 3<span style="color: #696969;">)</span> <span style="color: #696969;">(</span>choose 3 4 5<span style="color: #696969;">)</span> <span style="color: #696969;">(</span>choose  4 5 6<span style="color: #696969;">))</span> <span style="color: #5f9ea0; font-style: italic;">; </span><span style="color: #5f9ea0; font-style: italic;">=&gt; (3 4 5)</span>
</pre>
</div>
</div>
</div>
