src/scheme/continuation.org
**** 楼层问题
     #+BEGIN_EXAMPLE
       Baker、Cooper、Fletcher、Miller 和 Smith 住在五层公寓的不同层

       Baker 没住顶层

       Cooper 没住底层

       Fletcher 没住顶层和底层

       Miller 比 Cooper 住的高

       Smith 没有住与 Fletcher 相邻的层

       Fletcher 没有住与 Cooper 相邻的层

       问：这些人各住在哪一层？
     #+END_EXAMPLE

     首先定义辅助逻辑函数：
     #+BEGIN_SRC scheme 
  ;;; 确保某个谓词必须为真
  (define (require p)
    (if (not p) (amb)))

  ;;; 没有重复的元素
  (define (distinct? . ls)
    (let loop ((lst (car ls)))
      (let ((first (car lst)) (rest (cdr lst)))
	(cond 
	 ((null? rest) #t)
	 ((member first rest) #f)
	 (else (loop rest))))))
     #+END_SRC

     现在只需要用 _amb_ 简单列举各种可能性，就可以得到这个问题的解：

     #+BEGIN_SRC scheme
  ;;; 初始化
  (initialize-amb-fail)

  ;;; 楼层问题
  (define (multiple-dwelling)
    (let ((baker (amb 1 2 3 4 5))
	  (cooper (amb 1 2 3 4 5))
	  (fletcher (amb 1 2 3 4 5))
	  (miller (amb 1 2 3 4 5))
	  (smith (amb 1 2 3 4 5)))
      (require
       (distinct? (list baker cooper fletcher miller smith))) ; 没有人住在同一层
      (require (not (= baker 5))) ; baker 不住在 第5层
      (require (not (= cooper 1))) ; cooper 不住在 第1层
      (require (not (= fletcher 5))) ; fletcher 不住在 第5层
      (require (not (= fletcher 1))) ; fletcher 不住在 第1层
      (require (> miller cooper)) ; miller 比 cooper 住得高
      (require (not (= (abs (- smith fletcher)) 1))) ; smith 和 fletcher 不住在相邻的两层
      (require (not (= (abs (- fletcher cooper)) 1))) ; fletcher 和 cooper 不住在相邻的两层
      (list (list 'baker baker) ; 输出结果
	    (list 'cooper cooper)
	    (list 'fletcher fletcher)
	    (list 'miller miller)
	    (list 'smith smith))))
     #+END_SRC

     测试：
     #+BEGIN_SRC scheme
  (multiple-dwelling) 
  ;; => ((baker 3) (cooper 2) (fletcher 4) (miller 5) (smith 1))
     #+END_SRC

** 协程

*** 二叉树匹配
    #+BEGIN_EXAMPLE
      现在有两棵二叉树，需要对它们进行比较，看这两棵树是否 “匹配”，也就是说它们在遍历时，途经的叶子结点是否相同

      总是先访问左边的分支，再访问右边的分支
    #+END_EXAMPLE

    例如：

    + _(1 (2 3))_ 和 _((1 2) 3)_ 是 *匹配* 的。因为遍历时，经过的叶子依次都是 1, 2, 3
    + _(a (b c) d)_ 和 _(a b (d e))_ 是 *不匹配* 的。因为遍历时，经过的叶子依次是 _a, b, c, d_ 和 _a, b, d, e_ 


