html/scheme/continuation.html

<div id="outline-container-orgd6efaf5" class="outline-5">
<h5 id="orgd6efaf5">楼层问题</h5>
<div class="outline-text-5" id="text-orgd6efaf5">
<pre class="example">
Baker、Cooper、Fletcher、Miller 和 Smith 住在五层公寓的不同层

Baker 没住顶层

Cooper 没住底层

Fletcher 没住顶层和底层

Miller 比 Cooper 住的高

Smith 没有住与 Fletcher 相邻的层

Fletcher 没有住与 Cooper 相邻的层

问：这些人各住在哪一层？
</pre>

<p>
首先定义辅助逻辑函数：
</p>
<div class="org-src-container">
<pre class="src src-scheme"><span style="color: #5f9ea0; font-style: italic;">;;; </span><span style="color: #5f9ea0; font-style: italic;">&#30830;&#20445;&#26576;&#20010;&#35859;&#35789;&#24517;&#39035;&#20026;&#30495;</span>
<span style="color: #696969;">(</span><span style="color: #00bfff; font-weight: bold;">define</span> <span style="color: #696969;">(</span><span style="color: #daa520; font-weight: bold;">require</span> p<span style="color: #696969;">)</span>
  <span style="color: #696969;">(</span><span style="color: #00bfff; font-weight: bold;">if</span> <span style="color: #696969;">(</span>not p<span style="color: #696969;">)</span> <span style="color: #696969;">(</span>amb<span style="color: #696969;">)))</span>

<span style="color: #5f9ea0; font-style: italic;">;;; </span><span style="color: #5f9ea0; font-style: italic;">&#27809;&#26377;&#37325;&#22797;&#30340;&#20803;&#32032;</span>
<span style="color: #696969;">(</span><span style="color: #00bfff; font-weight: bold;">define</span> <span style="color: #696969;">(</span><span style="color: #daa520; font-weight: bold;">distinct?</span> . ls<span style="color: #696969;">)</span>
  <span style="color: #696969;">(</span><span style="color: #00bfff; font-weight: bold;">let</span> <span style="color: #daa520; font-weight: bold;">loop</span> <span style="color: #696969;">((</span>lst <span style="color: #696969;">(</span>car ls<span style="color: #696969;">)))</span>
    <span style="color: #696969;">(</span><span style="color: #00bfff; font-weight: bold;">let</span> <span style="color: #696969;">((</span>first <span style="color: #696969;">(</span>car lst<span style="color: #696969;">))</span> <span style="color: #696969;">(</span>rest <span style="color: #696969;">(</span>cdr lst<span style="color: #696969;">)))</span>
      <span style="color: #696969;">(</span><span style="color: #00bfff; font-weight: bold;">cond</span> 
       <span style="color: #696969;">((</span>null? rest<span style="color: #696969;">)</span> #t<span style="color: #696969;">)</span>
       <span style="color: #696969;">((</span>member first rest<span style="color: #696969;">)</span> #f<span style="color: #696969;">)</span>
       <span style="color: #696969;">(</span><span style="color: #00bfff; font-weight: bold;">else</span> <span style="color: #696969;">(</span>loop rest<span style="color: #696969;">))))))</span>
</pre>
</div>

<p>
现在只需要用 <span class="underline">amb</span> 简单列举各种可能性，就可以得到这个问题的解：
</p>

<div class="org-src-container">
<pre class="src src-scheme"><span style="color: #5f9ea0; font-style: italic;">;;; </span><span style="color: #5f9ea0; font-style: italic;">&#21021;&#22987;&#21270;</span>
<span style="color: #696969;">(</span>initialize-amb-fail<span style="color: #696969;">)</span>

<span style="color: #5f9ea0; font-style: italic;">;;; </span><span style="color: #5f9ea0; font-style: italic;">&#27004;&#23618;&#38382;&#39064;</span>
<span style="color: #696969;">(</span><span style="color: #00bfff; font-weight: bold;">define</span> <span style="color: #696969;">(</span><span style="color: #daa520; font-weight: bold;">multiple-dwelling</span><span style="color: #696969;">)</span>
  <span style="color: #696969;">(</span><span style="color: #00bfff; font-weight: bold;">let</span> <span style="color: #696969;">((</span>baker <span style="color: #696969;">(</span>amb 1 2 3 4 5<span style="color: #696969;">))</span>
        <span style="color: #696969;">(</span>cooper <span style="color: #696969;">(</span>amb 1 2 3 4 5<span style="color: #696969;">))</span>
        <span style="color: #696969;">(</span>fletcher <span style="color: #696969;">(</span>amb 1 2 3 4 5<span style="color: #696969;">))</span>
        <span style="color: #696969;">(</span>miller <span style="color: #696969;">(</span>amb 1 2 3 4 5<span style="color: #696969;">))</span>
        <span style="color: #696969;">(</span>smith <span style="color: #696969;">(</span>amb 1 2 3 4 5<span style="color: #696969;">)))</span>
    <span style="color: #696969;">(</span>require
     <span style="color: #696969;">(</span>distinct? <span style="color: #696969;">(</span>list baker cooper fletcher miller smith<span style="color: #696969;">)))</span> <span style="color: #5f9ea0; font-style: italic;">; </span><span style="color: #5f9ea0; font-style: italic;">&#27809;&#26377;&#20154;&#20303;&#22312;&#21516;&#19968;&#23618;</span>
    <span style="color: #696969;">(</span>require <span style="color: #696969;">(</span>not <span style="color: #696969;">(</span>= baker 5<span style="color: #696969;">)))</span> <span style="color: #5f9ea0; font-style: italic;">; </span><span style="color: #5f9ea0; font-style: italic;">baker &#19981;&#20303;&#22312; &#31532;5&#23618;</span>
    <span style="color: #696969;">(</span>require <span style="color: #696969;">(</span>not <span style="color: #696969;">(</span>= cooper 1<span style="color: #696969;">)))</span> <span style="color: #5f9ea0; font-style: italic;">; </span><span style="color: #5f9ea0; font-style: italic;">cooper &#19981;&#20303;&#22312; &#31532;1&#23618;</span>
    <span style="color: #696969;">(</span>require <span style="color: #696969;">(</span>not <span style="color: #696969;">(</span>= fletcher 5<span style="color: #696969;">)))</span> <span style="color: #5f9ea0; font-style: italic;">; </span><span style="color: #5f9ea0; font-style: italic;">fletcher &#19981;&#20303;&#22312; &#31532;5&#23618;</span>
    <span style="color: #696969;">(</span>require <span style="color: #696969;">(</span>not <span style="color: #696969;">(</span>= fletcher 1<span style="color: #696969;">)))</span> <span style="color: #5f9ea0; font-style: italic;">; </span><span style="color: #5f9ea0; font-style: italic;">fletcher &#19981;&#20303;&#22312; &#31532;1&#23618;</span>
    <span style="color: #696969;">(</span>require <span style="color: #696969;">(</span>&gt; miller cooper<span style="color: #696969;">))</span> <span style="color: #5f9ea0; font-style: italic;">; </span><span style="color: #5f9ea0; font-style: italic;">miller &#27604; cooper &#20303;&#24471;&#39640;</span>
    <span style="color: #696969;">(</span>require <span style="color: #696969;">(</span>not <span style="color: #696969;">(</span>= <span style="color: #696969;">(</span>abs <span style="color: #696969;">(</span>- smith fletcher<span style="color: #696969;">))</span> 1<span style="color: #696969;">)))</span> <span style="color: #5f9ea0; font-style: italic;">; </span><span style="color: #5f9ea0; font-style: italic;">smith &#21644; fletcher &#19981;&#20303;&#22312;&#30456;&#37051;&#30340;&#20004;&#23618;</span>
    <span style="color: #696969;">(</span>require <span style="color: #696969;">(</span>not <span style="color: #696969;">(</span>= <span style="color: #696969;">(</span>abs <span style="color: #696969;">(</span>- fletcher cooper<span style="color: #696969;">))</span> 1<span style="color: #696969;">)))</span> <span style="color: #5f9ea0; font-style: italic;">; </span><span style="color: #5f9ea0; font-style: italic;">fletcher &#21644; cooper &#19981;&#20303;&#22312;&#30456;&#37051;&#30340;&#20004;&#23618;</span>
    <span style="color: #696969;">(</span>list <span style="color: #696969;">(</span>list 'baker baker<span style="color: #696969;">)</span> <span style="color: #5f9ea0; font-style: italic;">; </span><span style="color: #5f9ea0; font-style: italic;">&#36755;&#20986;&#32467;&#26524;</span>
          <span style="color: #696969;">(</span>list 'cooper cooper<span style="color: #696969;">)</span>
          <span style="color: #696969;">(</span>list 'fletcher fletcher<span style="color: #696969;">)</span>
          <span style="color: #696969;">(</span>list 'miller miller<span style="color: #696969;">)</span>
          <span style="color: #696969;">(</span>list 'smith smith<span style="color: #696969;">))))</span>
</pre>
</div>

<p>
测试：
</p>
<div class="org-src-container">
<pre class="src src-scheme"><span style="color: #696969;">(</span>multiple-dwelling<span style="color: #696969;">)</span> 
<span style="color: #5f9ea0; font-style: italic;">;; </span><span style="color: #5f9ea0; font-style: italic;">=&gt; ((baker 3) (cooper 2) (fletcher 4) (miller 5) (smith 1))</span>
</pre>
</div>
</div>
</div>
</div>
</div>

<div id="outline-container-orgb050fef" class="outline-3">
<h3 id="orgb050fef">协程</h3>
<div class="outline-text-3" id="text-orgb050fef">
</div>
<div id="outline-container-org8ea1f06" class="outline-4">
<h4 id="org8ea1f06">二叉树匹配</h4>
<div class="outline-text-4" id="text-org8ea1f06">
<pre class="example">
      现在有两棵二叉树，需要对它们进行比较，看这两棵树是否 “匹配”，也就是说它们在遍历时，途经的叶子结点是否相同

      总是先访问左边的分支，再访问右边的分支
</pre>

<p>
例如：
</p>

<ul class="org-ul">
<li><span class="underline">(1 (2 3))</span> 和 <span class="underline">((1 2) 3)</span> 是 <b>匹配</b> 的。因为遍历时，经过的叶子依次都是 1, 2, 3</li>
<li><span class="underline">(a (b c) d)</span> 和 <span class="underline">(a b (d e))</span> 是 <b>不匹配</b> 的。因为遍历时，经过的叶子依次是 <span class="underline">a, b, c, d</span> 和 <span class="underline">a, b, d, e</span></li>
</ul>
</div>
