src/scheme/continuation.org
**** 直观思路
     最直观的算法: 
     1. _深度优先遍历_ 两棵二叉树
     2. 把途中遇到的叶子结点分别放到两个表里
     3. 对这两个表的元素挨个进行比较

     深度优先遍历二叉树，并把遇到的叶子节点放到一个表里：
     #+BEGIN_SRC scheme
  (define flatten
    (lambda (tree)
      (cond ((null? tree) '())
	    ((pair? (car tree))
	     (append (flatten (car tree))
		     (flatten (cdr tree))))
	    (else
	     (cons (car tree)
		   (flatten (cdr tree)))))))

  ;; (flatten '(1 (2 3))) ; =>  (1 2 3)
  ;; (flatten '((1 2) 3)) ; =>  (1 2 3)
     #+END_SRC

     对两个表进行比较：
     #+BEGIN_SRC scheme
  (define same-fringe?
    (lambda (tree1 tree2)
      (let loop ((ftree1 (flatten tree1))
		 (ftree2 (flatten tree2)))
	(cond ((and (null? ftree1) (null? ftree2)) #t)
	      ((or (null? ftree1) (null? ftree2)) #f)
	      ((eqv? (car ftree1) (car ftree2))
	       (loop (cdr ftree1) (cdr ftree2)))
	      (else #f)))))

  ;; (same-fringe? '(1 (2 3)) '((1 2) 3)) ; => #t 
  ;; (same-fringe? '(a (b c) d) '(a b (d e))) ; => #f
     #+END_SRC

     这种做法的问题是：必须先用一个展开过程遍历所有的叶结点，然而在比较时，往往到了中间某个叶结点(比如：c和d)就发生了不匹配，实际上后面的叶子根本不需要去访问

     能不能在 *对两棵树进行遍历的同时就两两比较叶子是否相同？一旦发现途中有一对叶子不同，马上就可以断定这两棵树不匹配* 

     #+BEGIN_EXAMPLE
       这么自然的想法，实际上却不容易用普通的控制结构实现

       在遇到一个叶子时，如何能够跳出遍历的过程，把这个叶子传递给一个比较过程？

       比较之后，又如何回到刚才遍历的路径中？

       如果要用 C 语言实现，该保存多少中间结果？是不是想用 longjump()，线程，甚至 server-client 结构，还要设计一套protocol？还是把递归展开，自己控制堆栈？

       一个可行的办法是改变数据结构，不用普通的二叉树，而使用线索二叉树。可是这会给程序加上很多复杂度。而且万一遍历的不是二叉树而是图又怎么办？
     #+END_EXAMPLE

