html/scheme/continuation.html


<div id="outline-container-orgde5613e" class="outline-5">
<h5 id="orgde5613e">直观思路</h5>
<div class="outline-text-5" id="text-orgde5613e">
<p>
最直观的算法: 
</p>
<ol class="org-ol">
<li><span class="underline">深度优先遍历</span> 两棵二叉树</li>
<li>把途中遇到的叶子结点分别放到两个表里</li>
<li>对这两个表的元素挨个进行比较</li>
</ol>

<p>
深度优先遍历二叉树，并把遇到的叶子节点放到一个表里：
</p>
<div class="org-src-container">
<pre class="src src-scheme"><span style="color: #696969;">(</span><span style="color: #00bfff; font-weight: bold;">define</span> <span style="color: #daa520; font-weight: bold;">flatten</span>
  <span style="color: #696969;">(</span><span style="color: #00bfff; font-weight: bold;">lambda</span> <span style="color: #696969;">(</span>tree<span style="color: #696969;">)</span>
    <span style="color: #696969;">(</span><span style="color: #00bfff; font-weight: bold;">cond</span> <span style="color: #696969;">((</span>null? tree<span style="color: #696969;">)</span> '<span style="color: #696969;">())</span>
          <span style="color: #696969;">((</span>pair? <span style="color: #696969;">(</span>car tree<span style="color: #696969;">))</span>
           <span style="color: #696969;">(</span>append <span style="color: #696969;">(</span>flatten <span style="color: #696969;">(</span>car tree<span style="color: #696969;">))</span>
                   <span style="color: #696969;">(</span>flatten <span style="color: #696969;">(</span>cdr tree<span style="color: #696969;">))))</span>
          <span style="color: #696969;">(</span><span style="color: #00bfff; font-weight: bold;">else</span>
           <span style="color: #696969;">(</span>cons <span style="color: #696969;">(</span>car tree<span style="color: #696969;">)</span>
                 <span style="color: #696969;">(</span>flatten <span style="color: #696969;">(</span>cdr tree<span style="color: #696969;">)))))))</span>

<span style="color: #5f9ea0; font-style: italic;">;; </span><span style="color: #5f9ea0; font-style: italic;">(flatten '(1 (2 3))) ; =&gt;  (1 2 3)</span>
<span style="color: #5f9ea0; font-style: italic;">;; </span><span style="color: #5f9ea0; font-style: italic;">(flatten '((1 2) 3)) ; =&gt;  (1 2 3)</span>
</pre>
</div>

<p>
对两个表进行比较：
</p>
<div class="org-src-container">
<pre class="src src-scheme"><span style="color: #696969;">(</span><span style="color: #00bfff; font-weight: bold;">define</span> <span style="color: #daa520; font-weight: bold;">same-fringe?</span>
  <span style="color: #696969;">(</span><span style="color: #00bfff; font-weight: bold;">lambda</span> <span style="color: #696969;">(</span>tree1 tree2<span style="color: #696969;">)</span>
    <span style="color: #696969;">(</span><span style="color: #00bfff; font-weight: bold;">let</span> <span style="color: #daa520; font-weight: bold;">loop</span> <span style="color: #696969;">((</span>ftree1 <span style="color: #696969;">(</span>flatten tree1<span style="color: #696969;">))</span>
               <span style="color: #696969;">(</span>ftree2 <span style="color: #696969;">(</span>flatten tree2<span style="color: #696969;">)))</span>
      <span style="color: #696969;">(</span><span style="color: #00bfff; font-weight: bold;">cond</span> <span style="color: #696969;">((</span><span style="color: #00bfff; font-weight: bold;">and</span> <span style="color: #696969;">(</span>null? ftree1<span style="color: #696969;">)</span> <span style="color: #696969;">(</span>null? ftree2<span style="color: #696969;">))</span> #t<span style="color: #696969;">)</span>
            <span style="color: #696969;">((</span><span style="color: #00bfff; font-weight: bold;">or</span> <span style="color: #696969;">(</span>null? ftree1<span style="color: #696969;">)</span> <span style="color: #696969;">(</span>null? ftree2<span style="color: #696969;">))</span> #f<span style="color: #696969;">)</span>
            <span style="color: #696969;">((</span>eqv? <span style="color: #696969;">(</span>car ftree1<span style="color: #696969;">)</span> <span style="color: #696969;">(</span>car ftree2<span style="color: #696969;">))</span>
             <span style="color: #696969;">(</span>loop <span style="color: #696969;">(</span>cdr ftree1<span style="color: #696969;">)</span> <span style="color: #696969;">(</span>cdr ftree2<span style="color: #696969;">)))</span>
            <span style="color: #696969;">(</span><span style="color: #00bfff; font-weight: bold;">else</span> #f<span style="color: #696969;">)))))</span>

<span style="color: #5f9ea0; font-style: italic;">;; </span><span style="color: #5f9ea0; font-style: italic;">(same-fringe? '(1 (2 3)) '((1 2) 3)) ; =&gt; #t </span>
<span style="color: #5f9ea0; font-style: italic;">;; </span><span style="color: #5f9ea0; font-style: italic;">(same-fringe? '(a (b c) d) '(a b (d e))) ; =&gt; #f</span>
</pre>
</div>

<p>
这种做法的问题是：必须先用一个展开过程遍历所有的叶结点，然而在比较时，往往到了中间某个叶结点(比如：c和d)就发生了不匹配，实际上后面的叶子根本不需要去访问
</p>

<p>
能不能在 <b>对两棵树进行遍历的同时就两两比较叶子是否相同？一旦发现途中有一对叶子不同，马上就可以断定这两棵树不匹配</b> 
</p>

<pre class="example">
       这么自然的想法，实际上却不容易用普通的控制结构实现

       在遇到一个叶子时，如何能够跳出遍历的过程，把这个叶子传递给一个比较过程？

       比较之后，又如何回到刚才遍历的路径中？

       如果要用 C 语言实现，该保存多少中间结果？是不是想用 longjump()，线程，甚至 server-client 结构，还要设计一套protocol？还是把递归展开，自己控制堆栈？

       一个可行的办法是改变数据结构，不用普通的二叉树，而使用线索二叉树。可是这会给程序加上很多复杂度。而且万一遍历的不是二叉树而是图又怎么办？
</pre>
</div>
</div>
