src/scheme/continuation.org
**** tree-generator 过程
     现在用 _continuation_ 来解决这个问题，就可以避免遍历，核心思路在于：

     #+BEGIN_EXAMPLE
       构建一个 tree->genenator 的函数, 它接受一个 二叉树 作为参数，每次调用它时都 返回一个新构造的函数 generate-leaves

       generate-leaves 函数就像在这棵二叉树里的步行者，它每次被调用时都会返回要访问的下一个叶子结点 
     #+END_EXAMPLE

     #+BEGIN_SRC scheme
  (define (tree->generator tree) ; 续延 0，返回给外层的比较函数
    (let ((caller '*)) ;; 初始化续延变量
      (letrec
	  ((generate-leaves ; 内部定义的函数 generate-leaves // 续延 1，返回给 续延 0   
	    (lambda ()
	      (let loop ((node tree)) ; named-let: 初始化 node 为 整课树 tree, 然后做遍历
		(cond ((null? node) 'skip) ; 到达底部，返回 'skip 
		      ((pair? node) ; 节点还是二叉树，顺序遍历 car, cdr 
		       (loop (car node))
		       (loop (cdr node)))
		      (else ; 节点是叶子
		       (call/cc ; 返回该叶节点作为生成器的结果，但是它会记住后续的循环并保存到 generate-leaves 变量
			(lambda (rest-of-tree) ; 把续延 1 作为参数 rest-of-tree 传入
			  (set! generate-leaves ; 重新设置 generate-leaves 过程
				(lambda ()
				  (rest-of-tree 'resume))) ; 记住续延1, ，下次调用 generate-leaves 时候，用来返回下一个访问到的节点
			  (caller node)))))) ; 返回当前节点
	      (caller '())))) ; => 循环结束才会被调用，返回一个空列表给caller。由于空列表不是一个合法的叶节点，用它来告诉生成器没有叶节点需要生成了
	(lambda ()
	  (call/cc
	   (lambda (k) ; 调用 tree->generator 的 续延0 被作为参数 k 传入
	     (set! caller k) ; 局部变量 caller 被初始化为 续延0 
	     (generate-leaves))))))) ; 初次调用 generate-leaves 过程

  ;; (define generator (tree-generator '(a (b c) d)))  ;
  ;; (generator) ; => a 
  ;; (generator) ; => b
  ;; (generator) ; => c 
  ;; (generator) ; => d 
  ;; (generator) ; => () 
  ;; (generator) ; => ()
     #+END_SRC

     + 当一个 _tree->generator_ 创建的生成器被调用时，这个生成器会把调用的续延存在 _caller_ 中，这样它就知道当找到叶节点时把它发送给谁
     + 它调用一个内部定义的函数 _generate-leaves_ ，该函数会从左到右循环遍历这个树。当循环到一个叶节点时，该函数就使用 _caller_ 来返回该叶节点作为生成器的结果，但是它会记住后续的循环（被 _call/cc_ 捕获为一个续延）并保存到 _generate-leaves_ 变量，下次生成器被调用时，循环从刚才终止的地方恢复，这样它可以寻找下一个叶节点

     #+BEGIN_EXAMPLE
       注意: generate-leaves 做的最后一件事情，在循环结束后，它返回一个空列表给 caller

       由于空列表不是一个合法的叶节点，可以用它来告诉生成器没有叶节点需要生成了 
     #+END_EXAMPLE

     最后改写 _same-fringe?_ ：把树作为参数来创建生成器，然后交替调用这两个生成器。只要一找到两个不同的叶节点就会返回失败：

     #+BEGIN_SRC scheme
  (define same-fringe?
    (lambda (tree1 tree2)
      (let ((gen1 (tree->generator tree1))
	    (gen2 (tree->generator tree2)))
	(let loop ()
	  (let ((leaf1 (gen1))
		(leaf2 (gen2)))
	    (if (eqv? leaf1 leaf2)
		(if (null? leaf1) #t (loop))
		#f))))))

  ;; (define tree1 '(((a b) (y z)) (3 4)))
  ;; (define tree2 '(((a b) (t z)) (3 4)))
  ;; (define tree3 '(((a (b y) z)) (3 4)))
  ;; (same-fringe? tree1 tree2) ; => #f
  ;; (same-fringe? tree1 tree3) ; => #t
     #+END_SRC

*** coroutine 
    #+BEGIN_EXAMPLE
      上面用到的生成器有个有趣的特点：每次被调用时，它都恢复计算，而且当它返回前会把它的续延保存在一个内部变量中，使得这个生成器可以再次恢复
    #+END_EXAMPLE

    如果对生成器进行推广，这样他们 *可以相互恢复其他的生成器，并且互相传递结果* 。这样的过程就叫 _协程_ 

