html/scheme/continuation.html

<div id="outline-container-org90469c1" class="outline-5">
<h5 id="org90469c1">tree-generator 过程</h5>
<div class="outline-text-5" id="text-org90469c1">
<p>
现在用 <span class="underline">continuation</span> 来解决这个问题，就可以避免遍历，核心思路在于：
</p>

<pre class="example">
构建一个 tree-&gt;genenator 的函数, 它接受一个 二叉树 作为参数，每次调用它时都 返回一个新构造的函数 generate-leaves

generate-leaves 函数就像在这棵二叉树里的步行者，它每次被调用时都会返回要访问的下一个叶子结点 
</pre>

<div class="org-src-container">
<pre class="src src-scheme"><span style="color: #696969;">(</span><span style="color: #00bfff; font-weight: bold;">define</span> <span style="color: #696969;">(</span><span style="color: #daa520; font-weight: bold;">tree-&gt;generator</span> tree<span style="color: #696969;">)</span> <span style="color: #5f9ea0; font-style: italic;">; </span><span style="color: #5f9ea0; font-style: italic;">&#32493;&#24310; 0&#65292;&#36820;&#22238;&#32473;&#22806;&#23618;&#30340;&#27604;&#36739;&#20989;&#25968;</span>
  <span style="color: #696969;">(</span><span style="color: #00bfff; font-weight: bold;">let</span> <span style="color: #696969;">((</span>caller '*<span style="color: #696969;">))</span> <span style="color: #5f9ea0; font-style: italic;">;; </span><span style="color: #5f9ea0; font-style: italic;">&#21021;&#22987;&#21270;&#32493;&#24310;&#21464;&#37327;</span>
    <span style="color: #696969;">(</span><span style="color: #00bfff; font-weight: bold;">letrec</span>
        <span style="color: #696969;">((</span>generate-leaves <span style="color: #5f9ea0; font-style: italic;">; </span><span style="color: #5f9ea0; font-style: italic;">&#20869;&#37096;&#23450;&#20041;&#30340;&#20989;&#25968; generate-leaves // &#32493;&#24310; 1&#65292;&#36820;&#22238;&#32473; &#32493;&#24310; 0   </span>
          <span style="color: #696969;">(</span><span style="color: #00bfff; font-weight: bold;">lambda</span> <span style="color: #696969;">()</span>
            <span style="color: #696969;">(</span><span style="color: #00bfff; font-weight: bold;">let</span> <span style="color: #daa520; font-weight: bold;">loop</span> <span style="color: #696969;">((</span>node tree<span style="color: #696969;">))</span> <span style="color: #5f9ea0; font-style: italic;">; </span><span style="color: #5f9ea0; font-style: italic;">named-let: &#21021;&#22987;&#21270; node &#20026; &#25972;&#35838;&#26641; tree, &#28982;&#21518;&#20570;&#36941;&#21382;</span>
              <span style="color: #696969;">(</span><span style="color: #00bfff; font-weight: bold;">cond</span> <span style="color: #696969;">((</span>null? node<span style="color: #696969;">)</span> 'skip<span style="color: #696969;">)</span> <span style="color: #5f9ea0; font-style: italic;">; </span><span style="color: #5f9ea0; font-style: italic;">&#21040;&#36798;&#24213;&#37096;&#65292;&#36820;&#22238; 'skip </span>
                    <span style="color: #696969;">((</span>pair? node<span style="color: #696969;">)</span> <span style="color: #5f9ea0; font-style: italic;">; </span><span style="color: #5f9ea0; font-style: italic;">&#33410;&#28857;&#36824;&#26159;&#20108;&#21449;&#26641;&#65292;&#39034;&#24207;&#36941;&#21382; car, cdr </span>
                     <span style="color: #696969;">(</span>loop <span style="color: #696969;">(</span>car node<span style="color: #696969;">))</span>
                     <span style="color: #696969;">(</span>loop <span style="color: #696969;">(</span>cdr node<span style="color: #696969;">)))</span>
                    <span style="color: #696969;">(</span><span style="color: #00bfff; font-weight: bold;">else</span> <span style="color: #5f9ea0; font-style: italic;">; </span><span style="color: #5f9ea0; font-style: italic;">&#33410;&#28857;&#26159;&#21494;&#23376;</span>
                     <span style="color: #696969;">(</span><span style="color: #00bfff; font-weight: bold;">call/cc</span> <span style="color: #5f9ea0; font-style: italic;">; </span><span style="color: #5f9ea0; font-style: italic;">&#36820;&#22238;&#35813;&#21494;&#33410;&#28857;&#20316;&#20026;&#29983;&#25104;&#22120;&#30340;&#32467;&#26524;&#65292;&#20294;&#26159;&#23427;&#20250;&#35760;&#20303;&#21518;&#32493;&#30340;&#24490;&#29615;&#24182;&#20445;&#23384;&#21040; generate-leaves &#21464;&#37327;</span>
                      <span style="color: #696969;">(</span><span style="color: #00bfff; font-weight: bold;">lambda</span> <span style="color: #696969;">(</span>rest-of-tree<span style="color: #696969;">)</span> <span style="color: #5f9ea0; font-style: italic;">; </span><span style="color: #5f9ea0; font-style: italic;">&#25226;&#32493;&#24310; 1 &#20316;&#20026;&#21442;&#25968; rest-of-tree &#20256;&#20837;</span>
                        <span style="color: #696969;">(</span>set! generate-leaves <span style="color: #5f9ea0; font-style: italic;">; </span><span style="color: #5f9ea0; font-style: italic;">&#37325;&#26032;&#35774;&#32622; generate-leaves &#36807;&#31243;</span>
                              <span style="color: #696969;">(</span><span style="color: #00bfff; font-weight: bold;">lambda</span> <span style="color: #696969;">()</span>
                                <span style="color: #696969;">(</span>rest-of-tree 'resume<span style="color: #696969;">)))</span> <span style="color: #5f9ea0; font-style: italic;">; </span><span style="color: #5f9ea0; font-style: italic;">&#35760;&#20303;&#32493;&#24310;1, &#65292;&#19979;&#27425;&#35843;&#29992; generate-leaves &#26102;&#20505;&#65292;&#29992;&#26469;&#36820;&#22238;&#19979;&#19968;&#20010;&#35775;&#38382;&#21040;&#30340;&#33410;&#28857;</span>
                        <span style="color: #696969;">(</span>caller node<span style="color: #696969;">))))))</span> <span style="color: #5f9ea0; font-style: italic;">; </span><span style="color: #5f9ea0; font-style: italic;">&#36820;&#22238;&#24403;&#21069;&#33410;&#28857;</span>
            <span style="color: #696969;">(</span>caller '<span style="color: #696969;">()))))</span> <span style="color: #5f9ea0; font-style: italic;">; </span><span style="color: #5f9ea0; font-style: italic;">=&gt; &#24490;&#29615;&#32467;&#26463;&#25165;&#20250;&#34987;&#35843;&#29992;&#65292;&#36820;&#22238;&#19968;&#20010;&#31354;&#21015;&#34920;&#32473;caller&#12290;&#30001;&#20110;&#31354;&#21015;&#34920;&#19981;&#26159;&#19968;&#20010;&#21512;&#27861;&#30340;&#21494;&#33410;&#28857;&#65292;&#29992;&#23427;&#26469;&#21578;&#35785;&#29983;&#25104;&#22120;&#27809;&#26377;&#21494;&#33410;&#28857;&#38656;&#35201;&#29983;&#25104;&#20102;</span>
      <span style="color: #696969;">(</span><span style="color: #00bfff; font-weight: bold;">lambda</span> <span style="color: #696969;">()</span>
        <span style="color: #696969;">(</span><span style="color: #00bfff; font-weight: bold;">call/cc</span>
         <span style="color: #696969;">(</span><span style="color: #00bfff; font-weight: bold;">lambda</span> <span style="color: #696969;">(</span>k<span style="color: #696969;">)</span> <span style="color: #5f9ea0; font-style: italic;">; </span><span style="color: #5f9ea0; font-style: italic;">&#35843;&#29992; tree-&gt;generator &#30340; &#32493;&#24310;0 &#34987;&#20316;&#20026;&#21442;&#25968; k &#20256;&#20837;</span>
           <span style="color: #696969;">(</span>set! caller k<span style="color: #696969;">)</span> <span style="color: #5f9ea0; font-style: italic;">; </span><span style="color: #5f9ea0; font-style: italic;">&#23616;&#37096;&#21464;&#37327; caller &#34987;&#21021;&#22987;&#21270;&#20026; &#32493;&#24310;0 </span>
           <span style="color: #696969;">(</span>generate-leaves<span style="color: #696969;">)))))))</span> <span style="color: #5f9ea0; font-style: italic;">; </span><span style="color: #5f9ea0; font-style: italic;">&#21021;&#27425;&#35843;&#29992; generate-leaves &#36807;&#31243;</span>

<span style="color: #5f9ea0; font-style: italic;">;; </span><span style="color: #5f9ea0; font-style: italic;">(define generator (tree-generator '(a (b c) d)))  ;</span>
<span style="color: #5f9ea0; font-style: italic;">;; </span><span style="color: #5f9ea0; font-style: italic;">(generator) ; =&gt; a </span>
<span style="color: #5f9ea0; font-style: italic;">;; </span><span style="color: #5f9ea0; font-style: italic;">(generator) ; =&gt; b</span>
<span style="color: #5f9ea0; font-style: italic;">;; </span><span style="color: #5f9ea0; font-style: italic;">(generator) ; =&gt; c </span>
<span style="color: #5f9ea0; font-style: italic;">;; </span><span style="color: #5f9ea0; font-style: italic;">(generator) ; =&gt; d </span>
<span style="color: #5f9ea0; font-style: italic;">;; </span><span style="color: #5f9ea0; font-style: italic;">(generator) ; =&gt; () </span>
<span style="color: #5f9ea0; font-style: italic;">;; </span><span style="color: #5f9ea0; font-style: italic;">(generator) ; =&gt; ()</span>
</pre>
</div>

<ul class="org-ul">
<li>当一个 <span class="underline">tree-&gt;generator</span> 创建的生成器被调用时，这个生成器会把调用的续延存在 <span class="underline">caller</span> 中，这样它就知道当找到叶节点时把它发送给谁</li>
<li>它调用一个内部定义的函数 <span class="underline">generate-leaves</span> ，该函数会从左到右循环遍历这个树。当循环到一个叶节点时，该函数就使用 <span class="underline">caller</span> 来返回该叶节点作为生成器的结果，但是它会记住后续的循环（被 <span class="underline">call/cc</span> 捕获为一个续延）并保存到 <span class="underline">generate-leaves</span> 变量，下次生成器被调用时，循环从刚才终止的地方恢复，这样它可以寻找下一个叶节点</li>
</ul>

<pre class="example">
       注意: generate-leaves 做的最后一件事情，在循环结束后，它返回一个空列表给 caller

       由于空列表不是一个合法的叶节点，可以用它来告诉生成器没有叶节点需要生成了 
</pre>

<p>
最后改写 <span class="underline">same-fringe?</span> ：把树作为参数来创建生成器，然后交替调用这两个生成器。只要一找到两个不同的叶节点就会返回失败：
</p>

<div class="org-src-container">
<pre class="src src-scheme"><span style="color: #696969;">(</span><span style="color: #00bfff; font-weight: bold;">define</span> <span style="color: #daa520; font-weight: bold;">same-fringe?</span>
  <span style="color: #696969;">(</span><span style="color: #00bfff; font-weight: bold;">lambda</span> <span style="color: #696969;">(</span>tree1 tree2<span style="color: #696969;">)</span>
    <span style="color: #696969;">(</span><span style="color: #00bfff; font-weight: bold;">let</span> <span style="color: #696969;">((</span>gen1 <span style="color: #696969;">(</span>tree-&gt;generator tree1<span style="color: #696969;">))</span>
          <span style="color: #696969;">(</span>gen2 <span style="color: #696969;">(</span>tree-&gt;generator tree2<span style="color: #696969;">)))</span>
      <span style="color: #696969;">(</span><span style="color: #00bfff; font-weight: bold;">let</span> <span style="color: #daa520; font-weight: bold;">loop</span> <span style="color: #696969;">()</span>
        <span style="color: #696969;">(</span><span style="color: #00bfff; font-weight: bold;">let</span> <span style="color: #696969;">((</span>leaf1 <span style="color: #696969;">(</span>gen1<span style="color: #696969;">))</span>
              <span style="color: #696969;">(</span>leaf2 <span style="color: #696969;">(</span>gen2<span style="color: #696969;">)))</span>
          <span style="color: #696969;">(</span><span style="color: #00bfff; font-weight: bold;">if</span> <span style="color: #696969;">(</span>eqv? leaf1 leaf2<span style="color: #696969;">)</span>
              <span style="color: #696969;">(</span><span style="color: #00bfff; font-weight: bold;">if</span> <span style="color: #696969;">(</span>null? leaf1<span style="color: #696969;">)</span> #t <span style="color: #696969;">(</span>loop<span style="color: #696969;">))</span>
              #f<span style="color: #696969;">))))))</span>

<span style="color: #5f9ea0; font-style: italic;">;; </span><span style="color: #5f9ea0; font-style: italic;">(define tree1 '(((a b) (y z)) (3 4)))</span>
<span style="color: #5f9ea0; font-style: italic;">;; </span><span style="color: #5f9ea0; font-style: italic;">(define tree2 '(((a b) (t z)) (3 4)))</span>
<span style="color: #5f9ea0; font-style: italic;">;; </span><span style="color: #5f9ea0; font-style: italic;">(define tree3 '(((a (b y) z)) (3 4)))</span>
<span style="color: #5f9ea0; font-style: italic;">;; </span><span style="color: #5f9ea0; font-style: italic;">(same-fringe? tree1 tree2) ; =&gt; #f</span>
<span style="color: #5f9ea0; font-style: italic;">;; </span><span style="color: #5f9ea0; font-style: italic;">(same-fringe? tree1 tree3) ; =&gt; #t</span>
</pre>
</div>
</div>
</div>
</div>

<div id="outline-container-orgdc0149f" class="outline-4">
<h4 id="orgdc0149f">coroutine</h4>
<div class="outline-text-4" id="text-orgdc0149f">
<pre class="example">
      上面用到的生成器有个有趣的特点：每次被调用时，它都恢复计算，而且当它返回前会把它的续延保存在一个内部变量中，使得这个生成器可以再次恢复
</pre>

<p>
如果对生成器进行推广，这样他们 <b>可以相互恢复其他的生成器，并且互相传递结果</b> 。这样的过程就叫 <span class="underline">协程</span> 
</p>
</div>
