src/scheme/continuation.org
**** 函数实现
     首先定义一个数据结构队列：
     + 添加：把一个元素添加到队列的最后
     + 取出：从队列的最开始取出一个元素，并移除出队列
     #+BEGIN_SRC scheme
  ;;; queue(FIFO) 
  (define (make-queue)
    (cons '() '()))

  ;;; 把一个元素加入到队列最后
  (define (enqueue! queue obj)
    (let ((lobj (list obj)))
      (if (null? (car queue))
	  (begin
	    (set-car! queue lobj)
	    (set-cdr! queue lobj))
	  (begin
	    (set-cdr! (cdr queue) lobj)
	    (set-cdr! queue lobj)))
      (car queue)))

  ;;; 从队列最前面取出一个元素
  (define (dequeue! queue)
    (let ((obj (car (car queue))))
      (set-car! queue (cdr (car queue)))
      obj))

  ;; (define test-queue (make-queue))
  ;; test-queue ;=>  (())
  ;; (enqueue! test-queue 'a)
  ;; test-queue ;=>   ((a) a)
  ;; enqueue! test-queue 'b)
  ;; test-queue ;=>   ((a b) b) 
  ;; (enqueue! test-queue 'c)
  ;; test-queue ;=>   ((a b c) c)
  ;; (dequeue! test-queue) ; => a 
  ;; test-queue ; => ((b c) c)
  ;; (dequeue! test-queue) ; => b 
  ;; test-queue ; => ((c) c)
  ;; (dequeue! test-queue) ; => a
  ;; test-queue ; => (() c) 
     #+END_SRC

     下面使用队列来定义协程：
     + _process-queue_ : 协程组成的队列
     #+BEGIN_SRC scheme 
  (define process-queue (make-queue)) ; 协程队列
     #+END_SRC
     + _coroutine_ ：把一个协程添加到队列最后
     #+BEGIN_SRC scheme
  ;;; 把一个协程添加到队列最后
  (define (coroutine thunk) 
    (enqueue! process-queue thunk))
     #+END_SRC
     + _start_ : 获得队列中的第一个元素，并执行它
     #+BEGIN_SRC scheme
  ;;; 获得队列中的第一个元素，并执行它 
  (define (start)
     ((dequeue! process-queue)))
     #+END_SRC
     + pause: 把当前续延添加到队列的最后，并且执行当前队列的第一个元素。
     #+BEGIN_SRC scheme
  (define (pause)
    (call/cc
     (lambda (k) ; 当前续延作为参数 k 传入
       (coroutine (lambda () (k #f))) ; 添加当前续延到最后
       (start)))) ; 执行当前队列第一个元素
     #+END_SRC

     两个协程交替打印数字和字母：
     #+BEGIN_SRC scheme
    ;;; example
  (coroutine (lambda ()
	       (let loop ((i 0)) 
		 (if (< i 10)
		     (begin
		       (display (1+ i)) 
		       (display " ")
		       (pause) 
		       (loop (1+ i)))))))

  (coroutine (lambda ()
	       (let loop ((i 0)) 
		 (if (< i 10)
		     (begin
		       (display (integer->char (+ i 97)))
		       (display " ")
		       (pause) 
		       (loop (1+ i)))))))

  (newline)
  (start)
  ;; 1 a 2 b 3 c 4 d 5 e 6 f 7 g 8 h 9 i 10 j
     #+END_SRC

