src/scheme/continuation.org
**** 宏实现
     #+BEGIN_EXAMPLE
       上面的代码的问题在于：
       1. 停止当前协程, 只能执行队列中的首个元素，这意味着我们需要考虑协程队列的顺序性
       2. 协程之间无法互相通信，传递计算值
     #+END_EXAMPLE

     接下来定义 _coroutine宏_ ：创建一个协程
     + 参数：
       + _x_ : *协程的初始参数*
       + _body_ : *协程执行内容* 
     + 返回:  *一个参数的匿名函数*  

     其主体包含 _resume调用_ ：保存当前协程的续延，转而执行另外一个协程
     + 参数：
       + _c_ ： 另外一个协程
       + _v_ : 另外一个协程执行用的需要的参数

     #+BEGIN_SRC scheme
  (require compatibility/defmacro)

  (define-macro coroutine
    (lambda (x . body) ; x ：协程A的初始参数，body：协程A的内容
      `(letrec ((+local-control-state (lambda (,x) ,@body)) ; 运行协程
		(resume ; 两个参数的函数，保存协程A的续延，转而执行协程B 
		 (lambda (c v) ; c: 另外一个协程B，v：执行用的参数
		   (call/cc
		    (lambda (k) ; 当前续延作为参数传入
		      (set! +local-control-state k) ; 把当前续延保存到 +local-control-state 
		      (c v)))))) ; 执行协程 B 
	 (lambda (v)
	   (+local-control-state v))))) ; 协程A恢复后，会从local-control-state变量里存放的续延开始
     #+END_SRC

     1. 调用 _coroutine宏_ 可以创建一个协程 _A_ ，这个协程可以有一个参数
     2. _A_ 有一个内部变量叫做 _+local-control-state_ 来 *保存任意时刻这个协程接下来的计算*
     3. 当调用 _resume_ 时，也就是调用另一个协程 _B_ 时：
	1. 当前协程 _A_ 会更新它的 _+local-control-state_ 变量为之后的计算
	2. 然后停止
	3. 然后执行恢复了的协程 _B_ 
     4. 当协程 _A_ 之后恢复时，它的计算会从 _+local-control-state_ 变量里 *存放的续延* 开始 
