html/scheme/continuation.html

<div id="outline-container-orgc2775d9" class="outline-5">
<h5 id="orgc2775d9">宏实现</h5>
<div class="outline-text-5" id="text-orgc2775d9">
<pre class="example">
上面的代码的问题在于：
1. 停止当前协程, 只能执行队列中的首个元素，这意味着我们需要考虑协程队列的顺序性
2. 协程之间无法互相通信，传递计算值
</pre>

<p>
接下来定义 <span class="underline">coroutine宏</span> ：创建一个协程
</p>
<ul class="org-ul">
<li>参数：
<ul class="org-ul">
<li><span class="underline">x</span> : <b>协程的初始参数</b></li>
<li><span class="underline">body</span> : <b>协程执行内容</b></li>
</ul></li>
<li>返回:  <b>一个参数的匿名函数</b></li>
</ul>

<p>
其主体包含 <span class="underline">resume调用</span> ：保存当前协程的续延，转而执行另外一个协程
</p>
<ul class="org-ul">
<li>参数：
<ul class="org-ul">
<li><span class="underline">c</span> ： 另外一个协程</li>
<li><span class="underline">v</span> : 另外一个协程执行用的需要的参数</li>
</ul></li>
</ul>

<div class="org-src-container">
<pre class="src src-scheme"><span style="color: #696969;">(</span>require compatibility/defmacro<span style="color: #696969;">)</span>

<span style="color: #696969;">(</span><span style="color: #00bfff; font-weight: bold;">define-macro</span> <span style="color: #4eee94;">coroutine</span>
  <span style="color: #696969;">(</span><span style="color: #00bfff; font-weight: bold;">lambda</span> <span style="color: #696969;">(</span>x . body<span style="color: #696969;">)</span> <span style="color: #5f9ea0; font-style: italic;">; </span><span style="color: #5f9ea0; font-style: italic;">x &#65306;&#21327;&#31243;A&#30340;&#21021;&#22987;&#21442;&#25968;&#65292;body&#65306;&#21327;&#31243;A&#30340;&#20869;&#23481;</span>
    `<span style="color: #696969;">(</span><span style="color: #00bfff; font-weight: bold;">letrec</span> <span style="color: #696969;">((</span>+local-control-state <span style="color: #696969;">(</span><span style="color: #00bfff; font-weight: bold;">lambda</span> <span style="color: #696969;">(</span>,x<span style="color: #696969;">)</span> ,@body<span style="color: #696969;">))</span> <span style="color: #5f9ea0; font-style: italic;">; </span><span style="color: #5f9ea0; font-style: italic;">&#36816;&#34892;&#21327;&#31243;</span>
              <span style="color: #696969;">(</span>resume <span style="color: #5f9ea0; font-style: italic;">; </span><span style="color: #5f9ea0; font-style: italic;">&#20004;&#20010;&#21442;&#25968;&#30340;&#20989;&#25968;&#65292;&#20445;&#23384;&#21327;&#31243;A&#30340;&#32493;&#24310;&#65292;&#36716;&#32780;&#25191;&#34892;&#21327;&#31243;B </span>
               <span style="color: #696969;">(</span><span style="color: #00bfff; font-weight: bold;">lambda</span> <span style="color: #696969;">(</span>c v<span style="color: #696969;">)</span> <span style="color: #5f9ea0; font-style: italic;">; </span><span style="color: #5f9ea0; font-style: italic;">c: &#21478;&#22806;&#19968;&#20010;&#21327;&#31243;B&#65292;v&#65306;&#25191;&#34892;&#29992;&#30340;&#21442;&#25968;</span>
                 <span style="color: #696969;">(</span><span style="color: #00bfff; font-weight: bold;">call/cc</span>
                  <span style="color: #696969;">(</span><span style="color: #00bfff; font-weight: bold;">lambda</span> <span style="color: #696969;">(</span>k<span style="color: #696969;">)</span> <span style="color: #5f9ea0; font-style: italic;">; </span><span style="color: #5f9ea0; font-style: italic;">&#24403;&#21069;&#32493;&#24310;&#20316;&#20026;&#21442;&#25968;&#20256;&#20837;</span>
                    <span style="color: #696969;">(</span>set! +local-control-state k<span style="color: #696969;">)</span> <span style="color: #5f9ea0; font-style: italic;">; </span><span style="color: #5f9ea0; font-style: italic;">&#25226;&#24403;&#21069;&#32493;&#24310;&#20445;&#23384;&#21040; +local-control-state </span>
                    <span style="color: #696969;">(</span>c v<span style="color: #696969;">))))))</span> <span style="color: #5f9ea0; font-style: italic;">; </span><span style="color: #5f9ea0; font-style: italic;">&#25191;&#34892;&#21327;&#31243; B </span>
       <span style="color: #696969;">(</span><span style="color: #00bfff; font-weight: bold;">lambda</span> <span style="color: #696969;">(</span>v<span style="color: #696969;">)</span>
         <span style="color: #696969;">(</span>+local-control-state v<span style="color: #696969;">)))))</span> <span style="color: #5f9ea0; font-style: italic;">; </span><span style="color: #5f9ea0; font-style: italic;">&#21327;&#31243;A&#24674;&#22797;&#21518;&#65292;&#20250;&#20174;local-control-state&#21464;&#37327;&#37324;&#23384;&#25918;&#30340;&#32493;&#24310;&#24320;&#22987;</span>
</pre>
</div>

<ol class="org-ol">
<li>调用 <span class="underline">coroutine宏</span> 可以创建一个协程 <span class="underline">A</span> ，这个协程可以有一个参数</li>
<li><span class="underline">A</span> 有一个内部变量叫做 <span class="underline">+local-control-state</span> 来 <b>保存任意时刻这个协程接下来的计算</b></li>
<li>当调用 <span class="underline">resume</span> 时，也就是调用另一个协程 <span class="underline">B</span> 时：
<ol class="org-ol">
<li>当前协程 <span class="underline">A</span> 会更新它的 <span class="underline">+local-control-state</span> 变量为之后的计算</li>
<li>然后停止</li>
<li>然后执行恢复了的协程 <span class="underline">B</span></li>
</ol></li>
<li>当协程 <span class="underline">A</span> 之后恢复时，它的计算会从 <span class="underline">+local-control-state</span> 变量里 <b>存放的续延</b> 开始</li>
</ol>
</div>
<ul class="org-ul">
