src/scheme/continuation.org
***** 简化二叉树匹配问题
      叶生成器协程：记住把它的节点返回给谁：
      #+BEGIN_SRC scheme
  (define (make-leaf-gen-coroutine tree matcher-cor) 
    (coroutine dont-need-an-init-arg ; 任意参数
	       (let loop ((node tree))
		 (cond ((null? node) 'skip)
		       ((pair? node)
			(loop (car node))
			(loop (cdr node)))
		       (else
			(resume matcher-cor node)))) ; 转而执行 matcher-cor 协程做比较，传递给 matcher-cor 的参数是当前的叶子节点 node   
	       (resume matcher-cor '()))) ; 转而执行 matcher-cor 协程，传递给 matcher-cor 的参数是空列表，通知 macher-cor 协程遍历完毕
      #+END_SRC

      _匹配叶子节点协程_ ： 依赖另外两个 _叶生成器协程_ 提供各自的叶节点
      #+BEGIN_SRC scheme
  (define (make-matcher-coroutine tree-cor-1 tree-cor-2) 
    (coroutine dont-need-an-init-arg ; 任意参数
	       (let loop ()
		 (let ((leaf1 (resume tree-cor-1 'get-1-a-leaf)) ; 转而执行 tree-cor-1 协程， 获取第一颗树的当前叶子节点，传递的参数可以任意
		       (leaf2 (resume tree-cor-2 'get-2-a-leaf))) ; 转而执行 tree-cor-2 协程， 获取第二颗树的当前叶子节点，传递的参数可以任意
		   (if (eqv? leaf1 leaf2)
		       (if (null? leaf1) #t (loop))
		       #f)))))
      #+END_SRC

      最后改写 _same-fringe?_ 函数：
      #+BEGIN_SRC scheme
  (define (same-fringe? tree1 tree2) 
    (letrec ((tree-cor-1 ; 创建 遍历第一颗树 协程
	      (make-leaf-gen-coroutine
	       tree1
	       (lambda (v) (matcher-cor v))))
	     (tree-cor-2 ; 创建 遍历第二颗树 协程
	      (make-leaf-gen-coroutine
	       tree2
	       (lambda (v) (matcher-cor v))))
	     (matcher-cor ; 创建 比较叶子节点 协程
	      (make-matcher-coroutine
	       (lambda (v) (tree-cor-1 v))
	       (lambda (v) (tree-cor-2 v)))))
      (matcher-cor 'start-ball-rolling)))

  ;; (define tree1 '(((a b) (y z)) (3 4)))
  ;; (define tree2 '(((a b) (t z)) (3 4)))
  ;; (define tree3 '(((a (b y) z)) (3 4)))
  ;; (same-fringe? tree1 tree2) ; => #f
  ;; (same-fringe? tree1 tree3) ; => #t
      #+END_SRC

      #+BEGIN_EXAMPLE
	在这个版本的same-fringe里已经完全没有调用call/cc的痕迹。宏coroutine管理了所有的协程
      #+END_EXAMPLE

