html/scheme/continuation.html
<li><a id="org8273a38"></a>简化二叉树匹配问题<br />
<div class="outline-text-6" id="text-org8273a38">
<p>
叶生成器协程：记住把它的节点返回给谁：
</p>
<div class="org-src-container">
<pre class="src src-scheme"><span style="color: #696969;">(</span><span style="color: #00bfff; font-weight: bold;">define</span> <span style="color: #696969;">(</span><span style="color: #daa520; font-weight: bold;">make-leaf-gen-coroutine</span> tree matcher-cor<span style="color: #696969;">)</span> 
  <span style="color: #696969;">(</span>coroutine dont-need-an-init-arg <span style="color: #5f9ea0; font-style: italic;">; </span><span style="color: #5f9ea0; font-style: italic;">&#20219;&#24847;&#21442;&#25968;</span>
             <span style="color: #696969;">(</span><span style="color: #00bfff; font-weight: bold;">let</span> <span style="color: #daa520; font-weight: bold;">loop</span> <span style="color: #696969;">((</span>node tree<span style="color: #696969;">))</span>
               <span style="color: #696969;">(</span><span style="color: #00bfff; font-weight: bold;">cond</span> <span style="color: #696969;">((</span>null? node<span style="color: #696969;">)</span> 'skip<span style="color: #696969;">)</span>
                     <span style="color: #696969;">((</span>pair? node<span style="color: #696969;">)</span>
                      <span style="color: #696969;">(</span>loop <span style="color: #696969;">(</span>car node<span style="color: #696969;">))</span>
                      <span style="color: #696969;">(</span>loop <span style="color: #696969;">(</span>cdr node<span style="color: #696969;">)))</span>
                     <span style="color: #696969;">(</span><span style="color: #00bfff; font-weight: bold;">else</span>
                      <span style="color: #696969;">(</span>resume matcher-cor node<span style="color: #696969;">))))</span> <span style="color: #5f9ea0; font-style: italic;">; </span><span style="color: #5f9ea0; font-style: italic;">&#36716;&#32780;&#25191;&#34892; matcher-cor &#21327;&#31243;&#20570;&#27604;&#36739;&#65292;&#20256;&#36882;&#32473; matcher-cor &#30340;&#21442;&#25968;&#26159;&#24403;&#21069;&#30340;&#21494;&#23376;&#33410;&#28857; node   </span>
             <span style="color: #696969;">(</span>resume matcher-cor '<span style="color: #696969;">())))</span> <span style="color: #5f9ea0; font-style: italic;">; </span><span style="color: #5f9ea0; font-style: italic;">&#36716;&#32780;&#25191;&#34892; matcher-cor &#21327;&#31243;&#65292;&#20256;&#36882;&#32473; matcher-cor &#30340;&#21442;&#25968;&#26159;&#31354;&#21015;&#34920;&#65292;&#36890;&#30693; macher-cor &#21327;&#31243;&#36941;&#21382;&#23436;&#27605;</span>
</pre>
</div>

<p>
<span class="underline">匹配叶子节点协程</span> ： 依赖另外两个 <span class="underline">叶生成器协程</span> 提供各自的叶节点
</p>
<div class="org-src-container">
<pre class="src src-scheme"><span style="color: #696969;">(</span><span style="color: #00bfff; font-weight: bold;">define</span> <span style="color: #696969;">(</span><span style="color: #daa520; font-weight: bold;">make-matcher-coroutine</span> tree-cor-1 tree-cor-2<span style="color: #696969;">)</span> 
  <span style="color: #696969;">(</span>coroutine dont-need-an-init-arg <span style="color: #5f9ea0; font-style: italic;">; </span><span style="color: #5f9ea0; font-style: italic;">&#20219;&#24847;&#21442;&#25968;</span>
             <span style="color: #696969;">(</span><span style="color: #00bfff; font-weight: bold;">let</span> <span style="color: #daa520; font-weight: bold;">loop</span> <span style="color: #696969;">()</span>
               <span style="color: #696969;">(</span><span style="color: #00bfff; font-weight: bold;">let</span> <span style="color: #696969;">((</span>leaf1 <span style="color: #696969;">(</span>resume tree-cor-1 'get-1-a-leaf<span style="color: #696969;">))</span> <span style="color: #5f9ea0; font-style: italic;">; </span><span style="color: #5f9ea0; font-style: italic;">&#36716;&#32780;&#25191;&#34892; tree-cor-1 &#21327;&#31243;&#65292; &#33719;&#21462;&#31532;&#19968;&#39063;&#26641;&#30340;&#24403;&#21069;&#21494;&#23376;&#33410;&#28857;&#65292;&#20256;&#36882;&#30340;&#21442;&#25968;&#21487;&#20197;&#20219;&#24847;</span>
                     <span style="color: #696969;">(</span>leaf2 <span style="color: #696969;">(</span>resume tree-cor-2 'get-2-a-leaf<span style="color: #696969;">)))</span> <span style="color: #5f9ea0; font-style: italic;">; </span><span style="color: #5f9ea0; font-style: italic;">&#36716;&#32780;&#25191;&#34892; tree-cor-2 &#21327;&#31243;&#65292; &#33719;&#21462;&#31532;&#20108;&#39063;&#26641;&#30340;&#24403;&#21069;&#21494;&#23376;&#33410;&#28857;&#65292;&#20256;&#36882;&#30340;&#21442;&#25968;&#21487;&#20197;&#20219;&#24847;</span>
                 <span style="color: #696969;">(</span><span style="color: #00bfff; font-weight: bold;">if</span> <span style="color: #696969;">(</span>eqv? leaf1 leaf2<span style="color: #696969;">)</span>
                     <span style="color: #696969;">(</span><span style="color: #00bfff; font-weight: bold;">if</span> <span style="color: #696969;">(</span>null? leaf1<span style="color: #696969;">)</span> #t <span style="color: #696969;">(</span>loop<span style="color: #696969;">))</span>
                     #f<span style="color: #696969;">)))))</span>
</pre>
</div>

<p>
最后改写 <span class="underline">same-fringe?</span> 函数：
</p>
<div class="org-src-container">
<pre class="src src-scheme"><span style="color: #696969;">(</span><span style="color: #00bfff; font-weight: bold;">define</span> <span style="color: #696969;">(</span><span style="color: #daa520; font-weight: bold;">same-fringe?</span> tree1 tree2<span style="color: #696969;">)</span> 
  <span style="color: #696969;">(</span><span style="color: #00bfff; font-weight: bold;">letrec</span> <span style="color: #696969;">((</span>tree-cor-1 <span style="color: #5f9ea0; font-style: italic;">; </span><span style="color: #5f9ea0; font-style: italic;">&#21019;&#24314; &#36941;&#21382;&#31532;&#19968;&#39063;&#26641; &#21327;&#31243;</span>
            <span style="color: #696969;">(</span>make-leaf-gen-coroutine
             tree1
             <span style="color: #696969;">(</span><span style="color: #00bfff; font-weight: bold;">lambda</span> <span style="color: #696969;">(</span>v<span style="color: #696969;">)</span> <span style="color: #696969;">(</span>matcher-cor v<span style="color: #696969;">))))</span>
           <span style="color: #696969;">(</span>tree-cor-2 <span style="color: #5f9ea0; font-style: italic;">; </span><span style="color: #5f9ea0; font-style: italic;">&#21019;&#24314; &#36941;&#21382;&#31532;&#20108;&#39063;&#26641; &#21327;&#31243;</span>
            <span style="color: #696969;">(</span>make-leaf-gen-coroutine
             tree2
             <span style="color: #696969;">(</span><span style="color: #00bfff; font-weight: bold;">lambda</span> <span style="color: #696969;">(</span>v<span style="color: #696969;">)</span> <span style="color: #696969;">(</span>matcher-cor v<span style="color: #696969;">))))</span>
           <span style="color: #696969;">(</span>matcher-cor <span style="color: #5f9ea0; font-style: italic;">; </span><span style="color: #5f9ea0; font-style: italic;">&#21019;&#24314; &#27604;&#36739;&#21494;&#23376;&#33410;&#28857; &#21327;&#31243;</span>
            <span style="color: #696969;">(</span>make-matcher-coroutine
             <span style="color: #696969;">(</span><span style="color: #00bfff; font-weight: bold;">lambda</span> <span style="color: #696969;">(</span>v<span style="color: #696969;">)</span> <span style="color: #696969;">(</span>tree-cor-1 v<span style="color: #696969;">))</span>
             <span style="color: #696969;">(</span><span style="color: #00bfff; font-weight: bold;">lambda</span> <span style="color: #696969;">(</span>v<span style="color: #696969;">)</span> <span style="color: #696969;">(</span>tree-cor-2 v<span style="color: #696969;">)))))</span>
    <span style="color: #696969;">(</span>matcher-cor 'start-ball-rolling<span style="color: #696969;">)))</span>

<span style="color: #5f9ea0; font-style: italic;">;; </span><span style="color: #5f9ea0; font-style: italic;">(define tree1 '(((a b) (y z)) (3 4)))</span>
<span style="color: #5f9ea0; font-style: italic;">;; </span><span style="color: #5f9ea0; font-style: italic;">(define tree2 '(((a b) (t z)) (3 4)))</span>
<span style="color: #5f9ea0; font-style: italic;">;; </span><span style="color: #5f9ea0; font-style: italic;">(define tree3 '(((a (b y) z)) (3 4)))</span>
<span style="color: #5f9ea0; font-style: italic;">;; </span><span style="color: #5f9ea0; font-style: italic;">(same-fringe? tree1 tree2) ; =&gt; #f</span>
<span style="color: #5f9ea0; font-style: italic;">;; </span><span style="color: #5f9ea0; font-style: italic;">(same-fringe? tree1 tree3) ; =&gt; #t</span>
</pre>
</div>

<pre class="example">
	在这个版本的same-fringe里已经完全没有调用call/cc的痕迹。宏coroutine管理了所有的协程
</pre>
</div>
</li>
